{
    // Paths
    APP_SUPPORT_PATH = "~/Library/Application Support";
    USER_PATH = "~/Library/Application Support/ChronoSync";
	BRIDGES_PATH  = "~/Library/Application Support/ChronoSync/Mail Bridges";
    SYNC_DOC_PATH = "~/Documents/ChronoSync Documents";
    LOGS_PATH = "~/Library/Logs/ChronoSync";
    TEMPLATES_PATH = "~/Library/Application Support/ChronoSync/Templates";
    GLOBAL_APP_SUPPORT_PATH = "/Library/Application Support/ChronoSync";
	DAEMON_NAME = "ChronoSync Scheduler.app";
    
    PATH_NAME_EDIT = "Click \"Choose...\" to select.";
    
	
	UNIQUE_NAME_FORMAT = "_v%03d";
    PATH_DOCUMENTS = "Documents";
	BUNDLE_TEMPLATES_PATH = "Templates";
	LOCAL_AGENT_APP_NAME = "ChronoAgentLocal.app";
	LAUNCHPATH_NAME = ".launchpath";
	DOCTRACKER_NAME = "Documents.data";
    EXPRESS_ABOUT_MENU = "About ChronoSync Express";
    EXPRESS_HIDE_MENU = "Hide ChronoSync Express";
    EXPRESS_OPEN_HELP_MENU = "ChronoSync Express Help";
    EXPRESS_OPEN_WEBSITE_MENU = "ChronoSync Express Web Site...";
    EXPRESS_QUIT_MENU = "Quit ChronoSync Express";
	
	// Sounds
	SUCCESS_SOUND = "Glass";
	FAILURE_SOUND = "Basso";
	ATTENTION_SOUND = "Morse";

	// License Restrictions
	LICENSE_VIOLATION_TITLE = "License Violation Detected";
	LICENSE_VIOLATION_MSG = "A copy of ChronoSync, with the same registration code, is already running at %@.";

	// Demo Restrictions
	DEMO_SYNC_LIMIT_MSG = "The demo version of ChronoSync only allows one synchronization per session. You may quit the program and try again.\n\nTo purchase ChronoSync just click the purchase button.\n\n";
	DEMO_FILE_LIMIT_MSG = "The demo version of ChronoSync only scans a maximum of 5000 files. The synchronization you just performed reached this limit and thus may not be complete.\n\nTo purchase ChronoSync just click the purchase button.\n\n";
	DEMO_RESTRICTION = "Demo restriction";
	DEMO_SYNC_ABORT = "*** Synchronization aborted due to demo restriction. ***";
	DEMO_SCAN_CAP = "*** Demo scan limit reached on previous execution. ***";

	// Evaluation Restrictions
    EVAL_TITLE = "Evaluation Copy";
    EVAL_MESSAGE = "This copy of ChronoSync is for evaluation only. It may not be sold, redistributed, or used for any other purpose.";
	
	// Backgrounder Messages
	BACKGROUNDER_NA = "Background Scheduler Not Available";
	BACKGROUNDER_NA_MSG = "The background scheduler does not appear to be installed. You should re-run the ChronoSync installer to ensure that scheduled synchronization is available.";
	BACKGROUNDER_OLD = "Background Scheduler Out-of-Date";
	BACKGROUNDER_OLD_MSG = "The background scheduler appears to be an older version and may not function properly. You should re-run the ChronoSync installer to ensure that scheduled synchronizations function properly.";
	
	// Tab Panels
    TAB_LABEL_TARGETS = "Setup";
    TAB_LABEL_ADVANCED = "Options";
    TAB_LABEL_RULES = "Rules";
    TAB_LABEL_ANALYZE = "Analyze";
    
    TAB_LABEL_ARCHIVE = "Archive";

    // Online Help
	HELP_CENTER = "ChronoSync Help Center";
	EXPRESS_HELP_CENTER = "ChronoSync Express Help Center";
	
	// Targets
	ROOT_FOLDER_DESC = "Root folder on \"%@\"";
	STD_FOLDER_DESC = "\"%@\" on \"%@\"";
    TARGET_SELECT = "Select";
    SOURCE_SELECT = "Select Left:";
    DEST_SELECT = "Select Right:";
    
	
	// Sync Operations
	BACKUP_LTOR = "Backup left-to-right";
	BACKUP_RTOL = "Backup right-to-left";
	INCREMENTAL_LTOR = "Blind backup left-to-right";
	INCREMENTAL_RTOL = "Blind backup right-to-left";
	MIRROR_LTOR = "Mirror left-to-right";
	MIRROR_RTOL = "Mirror right-to-left";
	BOOTABLE_LTOR = "Bootable left-to-right";
	BOOTABLE_RTOL = "Bootable right-to-left";
	BOOTABLE_MIRROR_LTOR = "Bootable mirror left-to-right";
	BOOTABLE_MIRROR_RTOL = "Bootable mirror right-to-left";
	SYNC_BIDIRECTIONAL = "Synchronize Bidirectional";
	
	// Control Panels
	TRIGGERS_CONTROL_PANEL = "Sync Triggers";
	HANDLING_CONTROL_PANEL = "Special File/Folder Handling";
	ERRORS_CONTROL_PANEL = "Reporting & Error Handling";
	EMAIL_CONTROL_PANEL	= "Notifications";
	ARCHIVE_CONTROL_PANEL = "Archive Handling";
	
	// Rule Types
	SIMPLE = "Simple";
	INTERMEDIATE = "Intermediate";
	ADVANCED = "Advanced";
    
    // Rule Names and Descriptions
    MOD_RULE_NAME = "Date/Time Last Modified";
    MOD_DATE_DESC = "modification date";
    CREATE_RULE_NAME = "Date/Time of Creation";
    CREATE_DATE_DESC = "creation date";
    FILE_KIND_RULE_NAME = "OS Type/Creator Codes";
    CREATOR_CODE_DESC = "Creator Code";
    TYPE_CODE_DESC = "Type Code";
    FILE_FLAG_RULE_NAME = "Attribute Flags";
    POSIX_RULE_NAME = "POSIX Permissions";
    FILE_NAME_NAME = "Name";
    FILE_NAME_DESC = "Actual ";
	DISPLAYED_NAME_NAME = "Displayed Name";
	DISPLAYED_NAME_DESC = "Displayed ";
    FILE_SIZE_NAME = "File Size";
    SIZE_DESC = "Size";
    FILE_EXTENSION_NAME = "Filename Extension";
    EXT_DESC = "Extension";
    FINDER_LABEL_RULE_NAME = "Finder Label";
	NO_LABEL = "╳ No Label";
	COLOR_DOT = "█";
    RULE_GROUP_NAME = "Rule Group";
    RULE_GROUP_DESC = "Contains %d rules.";
    PATH_NAME_NAME = "Path Name";

    SPOTLIGHT_COMMENT_NAME = "Spotlight Comment";
    SPOTLIGHT_COMMENT_DESC = "Spotlight comment for ";
    
    // Rule Tasks (for undo)
    ADD_RULE = "Add Rule";
    REMOVE_RULE = "Remove Rule";
    EDIT_RULE = "Edit Rule";
    INSERT_RULE = "Insert Rule";
    ENABLE_RULE = "Enable Rule";
    DISABLE_RULE = "Disable Rule";
	DRAG_RULE = "Drag Rule";

    // Compare Operators
    OP_IS = " is ";
    OP_IS_NOT = " is not ";
    OP_IS_STRING = " is ";
    OP_IS_NOT_STRING = " is not ";
    OP_IS_BEFORE = " is before ";
    OP_IS_AFTER = " is after ";
    OP_IS_TODAY = " is today ";
    OP_IS_YESTERDAY = " is yesterday ";
    OP_IS_WITHIN_ONE_DAY = " is within one day of ";
    OP_IS_WITHIN_TWO_DAYS = " is within two days of ";
    OP_IS_WITHIN_THREE_DAYS = " is within three days of ";
    OP_IS_WITHIN_ONE_WEEK = " is within one week of ";
    OP_IS_WITHIN_TWO_WEEKS = " is within two weeks of ";
    OP_IS_WITHIN_THREE_WEEKS = " is within three weeks of ";
    OP_IS_WITHIN_ONE_MONTH = " is within one month of ";
    OP_IS_WITHIN_TWO_MONTHS = " is within two months of ";
    OP_IS_WITHIN_THREE_MONTHS = " is within three months of ";
    OP_IS_WITHIN_SIX_MONTHS = " is within six months of ";
    OP_CONTAINS = " contains ";
    OP_DOESNT_CONTAIN = " doesn't contain ";
    OP_STARTS_WITH = " starts with ";
    OP_DOESNT_START_WITH = " doesn't start with ";
    OP_ENDS_WITH = " ends with ";
    OP_DOESNT_END_WITH = " doesn't end with ";
    OP_IS_EQUAL_TO = " is equal to ";
    OP_IS_GREATER_THAN = " is greater than ";
    OP_IS_LESS_THAN = " is less than ";

	// Boolean Operators
	OP_AND = "And";
	OP_OR = "Or";
  
    INITIAL_FILE_KIND = "????";
	RULEBASE_MODE_SUMMARY = "Rule Base Mode:";
   
    // Button States
    
    DONT_CARE2 = "'Don't Care'";
    LOCKED_ON = "Locked is On. ";
    LOCKED_OFF = "Locked is Off. ";
    CUSTOM_ICON_ON = "Custom Icon is On. ";
    CUSTOM_ICON_OFF = "Custom Icon is Off. ";
    STATIONERY_PAD_ON = "Stationery Pad is On. ";
    STATIONERY_PAD_OFF = "Stationery Pad is Off. ";
    INVISIBLE_ON = "Invisible is On. ";
    INVISIBLE_OFF = "Invisible is Off. ";
    ALIAS_ON = "Alias is On. ";
    ALIAS_OFF = "Alias is Off. ";
    PACKAGED_ON = "Packaged is On. ";
    PACKAGED_OFF = "Packaged is Off. ";
    MATCHING_FLAGS = "All Flags Match.";
    OWNER_READ_ON = "Own. Rd. = On. ";
    OWNER_READ_OFF = "Own. Rd. = Off. ";
    OWNER_WRITE_ON = "Own. Wr. = On. ";
    OWNER_WRITE_OFF = "Own. Wr. = Off. ";
    OWNER_EXE_ON = "Own. Exe. = On. ";
    OWNER_EXE_OFF = "Own. Exe. = Off. ";
    GROUP_READ_ON = "Grp. Rd. = On. ";
    GROUP_READ_OFF = "Grp. Rd. = Off. ";
    GROUP_WRITE_ON = "Grp. Wr. = On. ";
    GROUP_WRITE_OFF = "Grp. Wr. = Off. ";
    GROUP_EXE_ON = "Grp. Exe. = On. ";
    GROUP_EXE_OFF = "Grp. Exe. = Off. ";
    EVERYONE_READ_ON = "Every. Rd. = On. "; 
    EVERYONE_READ_OFF = "Every. Rd. = Off. ";
    EVERYONE_WRITE_ON = "Every. Wr. = On. ";
    EVERYONE_WRITE_OFF = "Every. Wr. = Off. ";
    EVERYONE_EXE_ON = "Every. Exe. = On. ";
    EVERYONE_EXE_OFF = "Every. Exe. = Off. ";
    MATCHING_PERMS = "All Permissions Match.";
    MATCHING_LABELS = "All Labels Match.";
	LABELS_NONE = "\"No Labels\" is on";
	LABELS_FORMAT = "\"%@\" is on";
	RULE_FOR = " for ";
	RULE_FILES_ONLY = "files";
	RULE_FOLDERS_ONLY = "folders";
	RULE_FILES_N_FOLDERS = "files & folders";
	RULE_FILE_ONLY = "file";
	RULE_FOLDER_ONLY = "folder";
	RULE_FILE_N_FOLDER = "file or folder";
	RULE_NAME = "name";
	RULE_FILE_PATH_ONLY = "File's parent path";
	RULE_FOLDER_PATH_ONLY = "Folder's parent path";
	RULE_FILE_N_FOLDER_PATH = "File or folder's parent path";
	RULE_FILES_ONLY2 = "File's";
	RULE_FOLDERS_ONLY2 = "Folder's";
	RULE_FILE_N_FOLDERS2 = "File or folder's";
    
    // File Size
	SINGLE_BYTE_VALUE_TYPE = " byte";
    BYTE_VALUE_TYPE = " bytes";
    KBYTE_VALUE_TYPE = " K";
    MBYTE_VALUE_TYPE = " MB";

	// Scripting
	SCRIPT_ERR_MSG = "Error %d occured while executing script at path: %@";

	// Script Tokens
	SENDFLAG_TOKEN = "*%SEND_FLAG%*";
	BODY_TOKEN = "*%MESSAGE_BODY%*";
	CR_BODY_TOKEN = "*%MESSAGE_BODY_CR%*";
	SUBJECT_TOKEN = "*%MESSAGE_SUBJECT%*";
	NAMES_TOKEN = "*%NAME_LIST%*";
	ADDRESS_TOKEN = "*%ADDRESS_LIST%*";
	ATTACHMENTS_TOKEN = "*%ATTACHMENT_LIST%*";

	// Email configuration
	DEFAULT_BRIDGE_SCRIPT = "1";
	ALT_BRIDGE_SCRIPT = "Apple Mail";
	NOTIFY_SUBJECT = "ChronoSync Notification";
	NOTIFY_ERRORS_SUBJECT = "ChronoSync Notification (w/Errors)";
	NOTIFY_TEST_MESSAGE = "Hello from ChronoSync!";
	NOTIFY_SUCCESS = "Success!";
	EMAIL_SUCCESS_MESSAGE = "A test email message was successfully sent.";
	NOTIFY_FAILURE = "Failure!";
	EMAIL_FAILURE_MESSAGE = "Could not send the test email message.";
	EMAIL_NO_RECIPIENTS_MESSAGE = "You must specify at least one email recipient.";
	EXPRESS_NOTIFY_SUBJECT = "ChronoSync Express Notification";
	EXPRESS_NOTIFY_ERRORS_SUBJECT = "ChronoSync Express Notification (w/Errors)";
	EXPRESS_NOTIFY_TEST_MESSAGE = "Hello from ChronoSync Express!";

    // Buttons
	CANCEL = "Cancel";
	OK = "OK";
	DELETE = "Delete";
	REMOVE = "Remove";
	CONTINUE = "Continue";
	SKIP = "Skip";
	RETRY = "Retry";
	REPLACE = "Replace";
	ABORT = "Abort";
	PROCEED = "Proceed";
	PURCHASE = "Purchase...";
	CONVERT = "Convert";
	
	
    
	// Administrative Restrictions
	NOT_AUTHORIZED = "Access Denied";
	NOT_AUTHORIZED_MSG = "You are not authorized to perform the requested operation. Only users with administrative privileges can gain access.";


	AUTHENTICATE = "Authenticate...";
	DEAUTHENTICATE = "Deauthenticate";
	
	// Document Kinds
	SYNC_DOC_KIND = "Synchronizer";
	CONTAINER_DOC_KIND = "Container";
	GENERAL_RULE_KIND = "General Rule";
	INCLUSION_RULE_KIND = "Inclusion Rule";
	EXCLUSION_RULE_KIND = "Exclusion Rule";

    // Deletions
	
	DEL_FAIL = "Deletion Failed";
	
	
    SYNC_DELETIONS_CHANGE = "Synchronize Deletions Change";
    DELETE_LABEL = "Delete...";
    DELETE_LABEL2 = "Delete";
    
    DELETING_FILE = "Occurred while deleting file";
    ARCHIVING_FILE = "Occurred while archiving file";
	FOLDER_DEL_FAIL = "Safe deletion failed";
    DELETE_RT_ARROW = "Deleted: -> %@";
    DELETE_LT_ARROW = "Deleted: <- %@";
	
	REM_ITEM_WARN_TITLE = "Remove Item";
	DEL_SCHED_WARN_TITLE = "Delete Scheduled Item";
	DEL_SCHED_WARN = "Are you sure you wish to delete the selected item?";
	REM_WARN = "Are you sure you wish to remove the selected item?";
	DEL_LOG_WARN_TITLE = "Clear Log";
	DEL_LOG_WARN = "Are you sure you wish to clear the entire log? This operation cannot be undone!";
	RULE_REMOVE = "Are you sure you wish to remove the selected rule?";
	SINGLE_DELETE_OP = "Single Item Deletion";
	SINGLE_DELETE_MSG = "Are you sure you wish to delete '%@ %@'? This operation is immediate and cannot be undone!\n";
	MULTI_DELETE_OP = "Multi Item Deletion";
	MULTI_DELETE_MSG = "Are you sure you wish to delete the selected items? This operation is immediate and cannot be undone!\n";
	RESTORE_FAILED_OP = "Restore Failed";
	RESTORE_PARENT_FAILED_MSG = "Could not create parent folder for the item '%@'.";

	
	RESTOR_FOLDER_PROMPT = "Select";
    
	REMOVE_LABEL = "Remove...";
    TOOL_TIP_REMOVE = "Remove selected item.";
	
	// Restorations
	
    RESTORE_DOWN_MSG = "Restored: <- %@";
    RESTORE_UP_MSG = "Restored: -> %@";

    // URLs
    BUY_URL = "http://www.econtechnologies.com/csbuy.html";
    BUY_AGENT_URL = "http://www.econtechnologies.com/csabuy.html";
    ECON_URL = "http://www.econtechnologies.com";
    TECH_URL = "http://www.econtechnologies.com/tsindex.html";
    COM_URL = "http://www.econtechnologies.com/cmindex.html";
    TIPS_URL = "http://www.econtechnologies.com/cstips.html";
	TRIAL_URL = "http://www.econtechnologies.com/cstrial.html";
	KEY_LOOKUP_URL = "http://www.econtechnologies.com/keylookup.html";
    WHATS_NEW_URL = "http://www.econtechnologies.com/csnotes.html";

    // Express URLs
    EXPRESS_WHATS_NEW_URL = "http://www.econtechnologies.com/csxnotes.html";
    EXPRESS_TIPS_URL = "http://www.econtechnologies.com/csxtips.html";
    EXPRESS_ECON_URL = "http://www.econtechnologies.com/csxoverview.html";

	// Changes
    RULE_BASE_MODE_CHANGE = "Rule Base Mode Change";
    
    COMP_OP_CHANGE = "Comparison Operation Change";
    SCOPE_CHANGE = "File/Folder Scope Change";
    MOD_DATE_CHANGE = "Modification Date Change";
    CREATE_DATE_CHANGE = "Creation Date Change";
    CREATOR_CODE_CHANGE = "Creator Code Change";
    FILE_TYPE_CODE_CHANGE = "File Type Code Change";
    DISPLAY_NAME_CHANGE = "Display Name Change";
	FILE_NAME_CHANGE = "Name Change";
    PATH_NAME_CHANGE = "Path Name Change";
    COMMENT_CHANGE = "Comment Change";
    VALUE_TYPE_CHANGE = "Value Type Change";
    FILE_SIZE_CHANGE = "File Size Change";
    FILE_EXTENSION_CHANGE = "File Extension Change";
    SYNC_OPERATION_CHANGE = "Sync. Operation Change";
    EQUALITY_THRESH_CHANGE = "Equality Threshold Change";
    IGNORE_INVIS_CHANGE = "Ignore Invisibles Change";
    RESOLVE_ALIAS_CHANGE = "Resolves Aliases Change";
	PRESERVE_COMMENTS_CHANGE = "Preserve Comments Change";
    
    DISSECT_PACKAGES_CHANGE = "Dissect Packages Change";
    PRUNE_FOLDERS_CHANGE = "Prune Folders Change";
    VERIFY_DATA_CHANGE = "Verify Copied Data Change";
    ARCHIVE_CHANGE = "Archive When Replacing Change";
    ARCHIVE_ADMIN_COUNT_CHANGE = "Archive File Count Change";
    ARCHIVE_ADMIN_PURGE_CHANGE = "Archive Auto-Purge Change";
	SKIP_ERRORS_CHANGE = "Skip Error Reporting Change";
    VERBOSE_LOG_CHANGE = "Verbose Logging Change";
	LIST_ALL_ENTRIES_CHANGE = "List All Entries Change";
	
	IGNORE_EA_ERRORS_CHANGE = "Ignore Extended Attribute Errors Change";
    TARGET_PATH_CHANGE = "Target Path Change";
	TARGET_DELETION_CHANGE = "Deletion Method Change";
    TARGET_MOUNT_CHANGE = "Target Mount Options Change";
    EXCLUSION_ACTION = "Exclusion";
    INCLUSION_ACTION = "Inclusion";
	FORCE_UPSTREAM_ACTION = "Force Left-to-Right";
	FORCE_DOWNSTREAM_ACTION = "Force Right-to-Left";
	RESET_ACTION = "Reset Direction";
	SORT_METHOD_CHANGE = "Sort Order Change";
	SEND_EMAIL_CHANGE = "Send Email Change";
	SEND_ONLY_ERRORS_CHANGE = "Send Only Errors Change";
	EMAIL_TYPE_CHANGE = "Email Type Change";
	EMAIL_RECIPIENT_CHANGE = "Email Recipient Change";
	RUN_SCRIPT_CHANGE = "Run Script Change";
	SCRIPT_FILE_CHANGE = "Script File Change";
	SCRIPT_SETTING_CHANGE = "Script Setting Change";
	PRE_DETERMINATION_CHANGE = "Pre-determination Change";
	PERMS_TRIGGER_CHANGE = "Access Permissions Trigger Change";
	TIMESTAMPS_TRIGGER_CHANGE = "Timestamps Trigger Change";
	FINDER_TRIGGER_CHANGE = "Finder Flags Trigger Change";
	BSD_TRIGGER_CHANGE = "BSD Flags Trigger Change";
	LOCK_TRIGGER_CHANGE = "Lock Status Trigger Change";
	OWNER_GROUP_TRIGGER_CHANGE = "Owner/Group Trigger Change";
	TYPE_CREATOR_TRIGGER_CHANGE = "HFS Type/Creator Trigger Change";
	
	MOD_DATE_TRIGGER_CHANGE = "Modification Date Trigger Change";
	DATA_SIZE_TRIGGER_CHANGE = "File Size Trigger Change";
	ALWAYS_TRIGGER_CHANGE = "Always Trigger Change";
    
    SYNC_TIME_NEVER = "Never";
	
    // Synchronization
    SYNCH_TIME_DESC = "Synchronizer last executed: ";
    SYNCH_LABEL = "Synchronize";
    TOOL_TIP_SYNCH = "Perform synchronization.";
    TRIAL_SYNCH_LABEL = "Trial Sync.";
    TOOL_TIP_TRIAL_SYNCH = "Performs a trial synchronization.";    
    SYNCHRONIZING = "Synchronizing: %@";
    COLLECTING = "Collecting Info: %@";
    SYNCH_PRUNE = "Pruned: %@";
    SYNCH_RT_ARROW = "Synchronized: -> %@";
    ATTR_SYNCH_RT_ARROW = "Attribute Sync.: -> %@";
    FORCE_SYNCH_RT_ARROW = "Force Synchronized: -> %@";
    SYNCH_LT_ARROW = "Synchronized: <- %@";
    ATTR_SYNCH_LT_ARROW = "Attribute Sync.: <- %@";
    FORCE_SYNCH_LT_ARROW = "Force Synchronized: <- %@";
    EXC_RT_ARROW = "Excluding: -> %@";
    LOG_TRIAL_START = "Trial synchronization start for: %@.";
    LOG_SYNC_START = "Synchronization start for: %@.";
    LOG_BASELINE_START = "Baseline scan start for: %@.";
    SYNCH_MSG = "Synchronizing...";
    BASELINE_MSG = "Baseline scan...";
    SYNC_COMPLETE = "Synchronization complete!";
	EMPTY_TRIAL_SYNC = "Trial-sync complete w/no files to synchronize!";
    BASELINE_COMPLETE = "Baseline scan complete!";
	ARCHIVE_CLEANUP_LEFT_MSG = "Maintaining left target archive...";
	ARCHIVE_CLEANUP_RIGHT_MSG = "Maintaining right target archive...";
	ARCHIVE_CLEANUP_FMT = "Maintaining: %@";
	ARCHIVE_PURGE_FMT = "Purged from %@: %@";
    SYNC_ABORTED = "Synchronization Aborted";
    BASELINE_ABORTED = "Baseline Scan Aborted";
    PERFORM_SCHED_SYNC_MSG = "Performing scheduled synchronization...";
	FILE_COUNT_SUMMARY = "%d files will be processed.";
	FILE_COUNT1_SUMMARY = "%d file will be processed.";
	LTOR_COUNT_SUMMARY = "Left-to-right: %d";
	RTOL_COUNT_SUMMARY = "Right-to-left: %d";
	CONFLICT_COUNT_SUMMARY = "Conflicts: %d";
	LDELETE_COUNT_SUMMARY = "Left Deletions: %d";
	RDELETE_COUNT_SUMMARY = "Right Deletions: %d";
	SECONDS_SUMMARY = "%@ seconds.";
	TOTAL_DURATION = "Total Duration: %@";
	BAD_TARGET = "Bad Target";
	SYNC_VERIFY_FAIL = "Could Not Locate Targets";
	SYNC_VERIFY_FAIL_MSG = "One or more targets are presently unavailable. Connect to the missing target and try again.";
	SAVING = "Saving...";

    // Scheduler
    SCHEDULE_LABEL = "Add to Schedule...";
    TOOL_TIP_ADD_TO_SCHEDULER = "Create a new scheduled item for this document.";  
    SCHEDULER_LABEL = "Show Schedule";  
    TOOL_TIP_SCHED_WINDOW = "Opens the Scheduled Documents Manager window if it is closed.";  
    SCHED_STARTED = "ChronoSync has started.";
    SCHED_CONTINUE = "Scheduler will attempt to continue.";
    SCHED_EXIT = "ChronoSync has exited.";
    SCHEDULED = "Scheduled: %@";
    ALERT_SCHED_ADD = "Can Not Add to Schedule";
    ALERT_SAVE_DOC = "The document must be saved before it can be added to the schedule.";
    ALERT_INVALID_DOC = "The document is not a valid type.";
    UNTITLED_SCHED_ITEM = "Untitled scheduled item.";
    ADD_SCHED_ITEM = "Add...";
    EDIT_SCHED_ITEM = "Edit...";
    REMOVE_SCHED_ITEM = "Remove...";
    DUPLICATE_SCHED_ITEM = "Duplicate";
    ACTIVATE_SCHED_ITEM = "Activate";
    DEACTIVATE_SCHED_ITEM = "Deactivate";
	SCHEDULER_SUSPENDED = "Scheduler is suspended.";
	SCHEDULER_ACTIVE = "Scheduler is active.";
	NEXT_SYNC_STR = "Next Sync: \"%@\", %@";
	EDIT_SCHEDULE_TITLE = "Edit Scheduled Synchronization";
	ADD_SCHEDULE_TITLE = "Add Scheduled Synchronization";
	ABORT_SYNC_LABEL = "Abort Synchronization";
	OPEN_DOC_LABEL = "Open Document";
	SCHEDULER_LOG_LABEL = "View Scheduler Log";
    SCHEDULER_ERROR_REF_DOC_TITLE = "Document Error";
    SCHEDULER_ERROR_REF_DOC = "The referenced document, '%@', could not be loaded!!!";
	OPEN_FILE_ITEM = "Open with Finder";
	REVEAL_FILE_ITEM = "Reveal in Finder";
	GET_FILE_INFO_ITEM = "Get Info in Finder";
    NO_DESC = "<no description>";

    // Container
    ADD_SYNCDOC_ITEM = "Add Item";
    REMOVE_SYNCDOC_ITEM = "Remove Item";
    MOVE_SYNCDOC_ITEM = "Move Item";
    ACTIVATE_SYNCDOC_ITEM = "Activate Item";
    DEACTIVATE_SYNCDOC_ITEM = "Deactivate Item";
	CONTAINER_SUMMARY_TEXT = "%d item(s) contained in document.";
	ACTIONS_MENU_TITLE = "Actions";

	// Launching files
	OPEN_FAILED = "Open Failed";
	OPEN_FAILED_DESC = "Could not open the file \"%@\" located at: %@";
	DUP_OPEN_MSG = "The specified file could not be opened because it is presently performing a synchronization. Try again when synchronization completes.";

	// Locating files
	LOCATE_FAILED = "Locate Failed";
	LOCATE_FAILED_DESC = "Could not locate the file \"%@\" at: %@";

    // Save
    SAVE_LABEL = "Save";
    TOOL_TIP_SAVE = "Save the document";
    SAVE_AS_LABEL = "Save As...";
    TOOL_TIP_SAVE_AS = "Save document in new file.";
    
    // Page Setup and Print
	TOOL_TIP_PRINT_ANALYSIS	= "Print analysis report.";
	TOOL_TIP_PRINT_LOG	= "Print log entries.";
	
    PAGE_SETUP_LABEL = "Page Setup...";
    TOOL_TIP_PAGE_SETUP = "Prepare document for printing.";
    
    // Log
    LOG_LABEL = "Log";
    TOOL_TIP_LOG = "Show log for this document.";
    
    // Options
    OPTIONS_LABEL = "Options";

    // Filter
    FILTER_LABEL = "Filter";
    
    
    // Compare
    COMPARE_LABEL = "Compare";
    TOOL_TIP_COMPARE = "Open source & destination to compare them.";
    
    // Include
    INCLUDE_LABEL = "Include";
    TOOL_TIP_INCLUDE = "Include the selected files\nin synchronization scans.";
    
    // Exclude
    EXCLUDE_LABEL = "Exclude";
    TOOL_TIP_EXCLUDE = "Exclude the selected files\nfrom synchronization scans.";
    
	// File Restore
	
	FILE_RESTORE2_LABEL = "Restore...";
    TOOL_TIP_FILE_RESTORE = "Restore using the previously copied\nversion of the selected file.";
	
	// Force Right
	FORCE_RIGHT_LABEL = "Force Right";
	TOOL_TIP_FORCE_RIGHT = "Override the current sync. status and force the\nselected file to be copied to the right target.";
	
	// Force Right Once
	FORCE_RIGHT_ONCE_LABEL = "Force Right (Once)";
	TOOL_TIP_FORCE_RIGHT_ONCE = "Override the current sync. status and force the\nselected file to be copied to the right target.\nResets after next synchronization.";
	
	// Force Left
	FORCE_LEFT_LABEL = "Force Left";
	TOOL_TIP_FORCE_LEFT = "Overide the current sync. status and force the\nselected file to be copied to the left target.";

	// Force Left Once
	FORCE_LEFT_ONCE_LABEL = "Force Left (Once)";
	TOOL_TIP_FORCE_LEFT_ONCE = "Overide the current sync. status and force the\nselected file to be copied to the left target.\nResets after next synchronization.";
	
	// Reset Direction
	RESET_DIR_LABEL = "Reset";
	TOOL_TIP_RESET_DIR = "Reset the sync. status to\nthe evaluated result.";

	// Refresh File List
	REFRESH_FILE_LIST_LABEL = "Refresh File List";
	
    
    
    
    
    // Add
    ADD_LABEL = "Add...";
    TOOL_TIP_ADD = "Add a sync. document from disk.";

    // Edit
    EDIT_LABEL = "Edit...";
    TOOL_TIP_EDIT = "Edit the selected document.";
	
	// Panels
	PANELS_LABEL = "Panels";
	TOOL_TIP_PANELS = "Switch between window panels.";
    
    // Menu Choices
    MENU_SELECT_ALL = "Select All";
    MENU_PASTE = "Paste";
    MENU_CLEAR = "Clear";
    MENU_CUT = "Cut";
    MENU_COPY = "Copy";
    MENU_PRINT = "Print...";
	MENU_SUSPEND_SCHEDULER = "Suspend Scheduler";
	MENU_RESUME_SCHEDULER = "Resume Scheduler";
	MENU_HIDE_SIDEBAR = "Hide Sidebar";
	MENU_SHOW_SIDEBAR = "Show Sidebar";

    // Errors
	ERROR_OCCURRED_TITLE = "••• An error occurred •••";
    ERROR_MSG = "Error";
    ERROR_CODE_MSG = "Error Code";
    ERROR_NOT_SAVE_FILE = "Could not save to file: ";
    
    ERROR_FILE_ACCESS = "There was a problem accessing one of the files.";
    ERROR_CANT_COMPARE = "Can not compare the files because they do not have the same extension and type.";
    ERROR_CANT_OPEN = "The requested application could not open the files.";
    ERROR_NO_DEFAULT_APP = "There is no default application that can open the files.";
	ERROR_SYNC_CANT_VERIFY = "Cannot locate target(s).";
	ERROR_BAD_SYMLINK = "Inconsistent symbolic link data.";
    ERROR_AT = "*** Error: %@";
    FOLDER_ENUMERATION_EXCEPTION = "*** Folder enumeration failed (Error: %d) for: %@";
    TARGET_VERIFY_EXCEPTION = "*** Cannot locate target: %@";
    WARNING_TARGET_VERIFY = "*** Cannot locate target ***";
	EA_COPY_ERROR_MSG = "The extended attributes could not be preserved.";
	ACL_COPY_ERROR_MSG = "The access control lists could not be preserved.";
    "Error Code: 1" = "Operation not permitted.";
    "Error Code: 2" = "No such file or directory.";
    "Error Code: 4" = "No such file or directory.";
    "Error Code: 5" = "General I/O error.";
    "Error Code: 13" = "Permission denied.";
    "Error Code: 28" = "No space left on device.";
    "Error Code: 45" = "Operation not supported.";

    "Error Code: 255" = "Could not obtain file lock.";
    "Error Code: 256" = "Read failure.";
    "Error Code: 257" = "Read permission denied.";
    "Error Code: 258" = "Bad file name.";
    "Error Code: 259" = "Corrupt file.";
    "Error Code: 260" = "No such file.";
    "Error Code: 261" = "Bad encoding.";
    "Error Code: 262" = "Unsupported scheme.";
    "Error Code: 263" = "Read too large.";
    "Error Code: 264" = "Bad encoding.";

    "Error Code: 512" = "Write failure.";
    "Error Code: 513" = "Write permission denied.";
    "Error Code: 514" = "Bad file name.";
    "Error Code: 517" = "Bad encoding.";
    "Error Code: 518" = "Unsupported scheme.";
    "Error Code: 640" = "No space left on device.";
    "Error Code: 642" = "Write on a read-only volume.";
    "Error Code: 1024" = "Key value validation failed.";
    "Error Code: 2048" = "Bad formatting.";
    "Error Code: 3072" = "User cancelled.";

    "Error Code: 1041" = "Size validation failed (Volume possibly full).";
    "Error Code: -34" = "Volume is full.";
    "Error Code: -35" = "Volume not found.";
    "Error Code: -36" = "General I/O error.";
    "Error Code: -37" = "Bad filename or volume name.";
    "Error Code: -43" = "File not found.";
    "Error Code: -44" = "Hardware volume lock.";
    "Error Code: -45" = "File is locked.";
    "Error Code: -46" = "Software volume lock.";
    "Error Code: -47" = "File is in use by another application.";
    "Error Code: -48" = "A file with the specified name already exists.";
    "Error Code: -49" = "File already open for writing.";
    "Error Code: -50" = "Parameter error.";
    "Error Code: -51" = "Reference number specifies nonexistent access path; bad working directory reference number.";
    "Error Code: -53" = "Volume is offline.";
    "Error Code: -54" = "File is exclusively open by another application.";
    "Error Code: -57" = "Volume lacks Macintosh-format directory.";
    "Error Code: -61" = "Read/write permission doesn't allow writing.";
    "Error Code: -120" = "Directory not found.";
    "Error Code: -123" = "Not an HFS volume.";
    "Error Code: -124" = "Server volume has been disconnected.";
    "Error Code: -1304" = "Folder contents changed during enumeration.";
	"Error Code: -1403" = "Data verification failed.";
	"Error Code: -1410" = "File/folder name incompatible with file system (possibly too long).";
	"Error Code: -1411" = "Bad unicode file/folder name";
	"Error Code: -3168" = "File is being (or has been) modified by another process.";
    "Error Code: -5000" = "Permission denied.";
    "Error Code: -5016" = "Server is not responding.";
    "Error Code: -5023" = "User authentication failed (usually, password is not correct).";
    "Error Code: -5042" = "Password has expired on server.";
	"Error Code: -32021" = "Access control lists could not be preserved.";
	"Error Code: -32022" = "Extended attributes could not be preserved.";
	
	SAFE_COPY_ERROR = "Could not safely replace file (possibly a permissions issue)";
 

	DUP_FILE_TITLE = "Duplicate File";
	DUP_FILE_MSG = "A file with the name '%@' already exists at the specified location.";
	
 	FILE_FORMAT_TITLE = "Can't Open File";
	FILE_FORMAT_MESSAGE = "The format of data in this document is too new to be opened by ChronoSync.";
	DUP_VERSIONS_TITLE = "Multiple Version Warning";
	DUP_VERSIONS_MSG = "You have selected multiple versions of the same file for restoration. Only the most recent version will actually be restored.";

    DOC_KIND_FOLDER = "Folder";
    UNKNOWN = "Unknown";
	
	NO_HELPER_MSG = "A helper tool for comparing these files has not been specified in Preferences.";
    
    // File Extensions
    FILE_EXT_FOLDER = ".folder";
        
	// Warnings
	LEFT_STR = "Left target";
	RIGHT_STR = "Right target";
	LEFT_AND_RIGHT_STR = "Left and right targets";
	TARGET_WARN_STR = "%@ cannot be located.";
	WARNING_LABEL = "Warning";
	WARNING_TITLE = "Warning: %@";
	OLD_FORMAT_LABEL = "Old File Format Detected";
	OLD_FORMAT_MESSAGE = "This document was created by an older version of ChronoSync. Would you like to convert it to the ChronoSync 4.0 file format?";
	
	ROLLBACK_TITLE = "Modification Date Roll-back Detected!";
	ROLLBACK_WARN_MSG = "Proceeding with synchronization will result in an older version of this file replacing a newer one.\n\nPath: %@";
	SYNC_OP_WARNING = "Changing the synchronization operation for a previously synchronized document may lead to undesired results. Are you sure you want to do this?\n";
	RESOLVE_ALIAS_WARNING = "Toggling the 'Resolve Aliases' setting for a bidirectional, previously synchronized document may lead to undesired results. Are you sure you want to do this?";
	BASELINE_LABEL = "Baseline Scan";
	BASELINE_SCAN_WARNING = "The baseline scan performs a mock synchronization, recording the state of all files in your targets. This has the effect of making the synchronizer think all files are in sync, even when they might not be.\n\nAre you sure you want to do this?\n";


	BSDFLAGS_WARN_LABEL = "BSD Flags Trigger Warning";
	BSDFLAGS_WARN_MSG = "Some BSD flags can only be preserved when running in administrative mode. This trigger will only work for the 'user-level' flags.";
	ALWAYSTRIGGER_WARN_LABEL = "Always Trigger Warning";
	ALWAYSTRIGGER_WARN_MSG = "Enabling this setting will cause all files to be copied regardless of whether or not they have changed. You typically use this in conjunction with custom rules to determine what files should be copied.";
	PRESERVECOMMENTS_WARN_LABEL = "Preserve Comments Notice";
	PRESERVECOMMENTS_WARN_MSG = "Having 'Ignore invisibles' disabled while 'Preserve comments' is enabled may be redundant. Refer to the Q&A in the online help for more information.";
	RALIAS_WARN_LABEL = "Resolve Alias Warning";
	RALIAS_WARN_MSG = "Resolving aliases is an advanced level feature that is only useful in very specific circumstances. You should think twice about enabling this setting.";
	MOUNT_FAILED_TITLE = "Mount Failed";
	MOUNT_FAILED_MSG = "Could not mount the volume: %@";
	EA_COPY_WARN_MSG = "Warning: %@ has been successfully synchronized.  However, its extended attributes could not be preserved.";
	ACL_COPY_WARN_MSG = "Warning: %@ has been successfully synchronized.  However, its access control lists could not be preserved.";
	DELFOLDER_WARN_LABEL = "Deletion Method Warning";
	DELETE_MIGRATE_MESSAGE = "This document is configured to synchronize deletions using the 'Move to '%@' folder' deletion method. This method is being phased out. Do you want to switch to the new 'Move to Archive' option at this time?\n";
	SWITCH_DELETE = "Switch to Archive";
	KEEP_DELETE = "Keep '%@'";
	CANT_ARCHIVE = "Archive Options Warning";
	CANT_ARCHIVE_MSG = "The archive options specified in this document will be automatically disabled if you save to a file format older than version 3.1";
	ZIP_FAIL_WARN_MSG = "Warning: Could not compress %@ while adding it to the archive.  Attempting to move it uncompressed.";
	BACKUP_COPY_LABEL = "Backup Copy Detected";
	BACKUP_COPY_MESSAGE = "This document appears to be a backup copy of the original \"%@\" document. You should be working with the original file whose filename does not end with a tilde ('~'). If you want to continue working with this document, you should choose \"Save as...\" and give it a new name.\n\nNote: Creation of document backups is controlled in the ChronoSync Preferences dialog.\n";
    
	EA_PRESERVE_WARNING = "Your sync document is configured to preserve Extended Attributes. Many file servers, especially NAS devices, do not support Extended Attributes and this may cause synchronizations to fail.\n\nDo you want to disable Extended Attribute preservation?";
	EA_DISABLE_COMPLETE = "The preservation settings have been disabled. You can re-enable them in the 'Special File/Folder Handling' section of the 'Options' panel.";
	OP_SKIPPED = "Operation skipped";
	EA_DISABLE_SKIPPED = "Your preservation settings have not been altered. You can change them manually in the 'Special File/Folder Handling' section of the 'Options' panel.";
	
	// Log
    SCH_LOG = "Scheduler Log";
    LOG_USER_ABORT = "'%@' was aborted by the user.";
    LOG_IS_STARTING = "'%@' is starting ...";
    LOG_COULDNT_VERIFY_TARGETS = "ERROR:  Could not locate target for '%@'.";
    LOG_PRESYNC_FAILED = "ERROR:  Pre-synchronization failed for '%@'.";
    LOG_READINESS_FAILED = "ERROR:  Readiness test failed for '%@'.";
    LOG_COULDNT_CONNECT_TARGETS = "ERROR:  Could not connect to target for '%@'.";
    LOG_COULDNT_START = "ERROR:  '%@' could not be started.";
    LOG_BUSY_RESCHED_LATER = "BUSY:  '%@' is already running.  Will try to reschedule later.";
    //LOG_BUSY = "BUSY:  '%@' is already running.";
    LOG_SCHED_ABORT = "Scheduler is aborting this item.";
    LOG_FATAL_ERROR = "FATAL ERROR:  '%@' can not be run.  It may be corrupt.";
    LOG_SCHED_SYNC_COMPLETE = "Scheduled synchronization complete!";
    LOG_ERROR_WARNING = "WARNING: %d errors occurred during the synchronization.";
    LOG_CONTAINER_ERROR_WARNING = "WARNING: %d errors occurred during the synchronization of '%@'.";
    LOG_EVENT_DONE = "... '%@' has finished.";
    LOG_ERROR_REF_DOC = "ERROR: The referenced document '%@' can no longer be found!!!";
    SYNC_LOG = "Synchronizer Log for: %@";
    LOG_INFO = "Scanned: %d   Processed: %d   Data copied: %@   Skipped: %d   Errors: %d";
    PARENS_LOG_DETAIL = "%d (see log for details)";

	// Analysis Report
	FOLDER_LABEL = "Folder:";
	SUBPATH_LABEL = "Subpath:";
	FOLDER_PRT_SUMMARY = "%d entries.";
	CHRONO_DOC_SUMMARY = "ChronoSync Document:";
	
	
	SYNC_OP_SUMMARY = "Operation:";
	SYNC_DEL_SUMMARY = "Synchronize Deletions:";
	TRIGGERS_LABEL = "Sync. Triggers:";
	BASIC_TRIGGER_SUMMARY = "Basic";
	BASIC_ATTR_TRIGGER_SUMMARY = "Basic w/Attributes";
	EXTENDED_TRIGGER_SUMMARY = "Extended";
	ALWAYS_TRIGGERS = "All Files Will Trigger";
	MOD_DATE_SUMMARY = "Modification Date:";
	DATA_SIZE_SUMMARY = "File Size:";
	TIMESTAMPS_SUMMARY = "Timestamps:";
	ACCESS_PERMS_SUMMARY = "Access Permisions:";
	FINDER_FLAGS_SUMMARY = "Finder Flags:";
	LOCKED_STATUS_SUMMARY = "Locked Status:";
	TYPE_CREATOR_SUMMARY = "HFS Type/Creator:";
	OWNER_GROUP_SUMMARY = "Owner/Group:";
	BSD_FLAGS_SUMMARY = "BSD Flags:";
	FILENAME_CASE_SUMMARY = "Filename case:";
	EXTENDED_ATTRIBUTES_SUMMARY = "Extended Attributes:";
	ACL_SUMMARY = "Access Control List:";
	COMMENTS_SUMMARY = "Comments:";
	SPECIAL_HANDLING_LABEL = "Special File/Folder Handling:";
	BASIC_HANDLING_SUMMARY = "Basic";
	BASIC_VERIFY_HANDLING_SUMMARY = "Basic w/Verification";
	SMART_SCAN_SUMMARY = "SmartScan (when available):";
	DATA_VALIDATE_SUMMARY = "Verify Copied Data:";
	ERROR_HANDLING_LABEL = "Reporting & Error Handling:";
	PRE_DETERMINATION_LABEL = "Pre-determination:";
	ROLL_BACKS_SUMMARY = "Date roll-backs:";
	CONFLICTS_SUMMARY = "Conflicts:";
	IGNORE_INVISIBLE_SUMMARY = "Ignore Invisibles:";
	
	RESOLVE_ALIAS_SUMMARY = "Resolve Aliases:";
	SHOW_COMPLETION_SUMMARY = "Show Completion Summary:";
	RETRY_ERRORS_SUMMARY = "Retry Errors:";
	ERRORS_SUMMARY = "Errors:";
	
	PRESERVE_COMMENTS_SUMMARY = "Preserve comments:";
	PRESERVE_ACL_SUMMARY = "Preserve access control lists:";
	PRUNE_FOLDERS_SUMMARY = "Don't create empty folders:";
	DISABLE_SAFE_COPY_SUMMARY = "Disable safe-copy:";
	DISSECT_PACKAGES_SUMMARY = "Dissect Packages:";
	
	VERBOSE_LOG_SUMMARY = "Post Detailed Log Entries:";
	SKIP_EA_ACL_ERRORS = "Ignore Extended Attribute and Access Control List Errors:";
	ALLOWED_TIME_DIFF_SUMMARY = "Allowed Time Difference (secs.):";
	EMAIL_LABEL = "Email Notifications:";
	SEND_EMAIL_SUMMARY = "Send Email Notifications to:";
	EMAIL_ON_ERRORS_SUMMARY = "Send on Error Only:";
	EMAIL_DETAIL_LEVEL_SUMMARY = "Detail Level:";
	EMAIL_SUMMARY_ONLY = "Summary";
	EMAIL_ERRORS_AND_SUMMARY = "Errors & Summary";
	EMAIL_FULL_LOG = "All Log Entries";
	EMAIL_CUSTOM_SUBJECT_SUMMARY = "Custom email subject lines:";
	SEND_EMAIL_DISABLED = "Email Notifications are Disabled";
	SCRIPTS_LABEL = "Scripts:";
	PRE_SYNC_SCRIPT_SUMMARY = "Pre-Synchronization Script:";
	POST_SYNC_SCRIPT_SUMMARY = "Post-Synchronization Script:";
	SCRIPT_ABORT_ON_ERRORS = "Abort on Script Errors:";
	
	
	ARCHIVE_HANDLING_LABEL = "Archive Handling:";
	ARCHIVING_DISABLED = "Archiving is Disabled";
	ARCHIVE_REPLACE_SUMMARY = "Archive When Replacing:";
	ARCHIVE_DELETE_SUMMARY = "Archive On Deletions:";
	
	ARCHIVE_LIMIT_MAX_MODE = "more than";
	ARCHIVE_LIMIT_FORMAT_STR = "Limit duplicates in archive to no %@ %d copies.";
	ARCHIVE_PURGE_PERIOD_MINUTES = "minutes";
	ARCHIVE_PURGE_PERIOD_HOURS = "hours";
	ARCHIVE_PURGE_PERIOD_DAYS = "days";
	ARCHIVE_PURGE_PERIOD_WEEKS = "weeks";
	ARCHIVE_PURGE_FORMAT_STR = "Purge files archived more than %d %@.";
	ARCHIVE_PURGE_MINIMUM_STR = " Keep at least %d copies.";
	ARCHIVE_COMPRESS_SUMMARY = "Compress files:";
	ARCHIVE_COPY_SUMMARY = "Copy instead of moving:";
	READINESS_LABEL = "Readiness:";
	
	// Conflicts
	CONFLICT_ENC = "Conflict encountered: %@";
    ATTRIBS_CONFLICT_ENC = "Attribute conflict encountered: %@";
    CANT_RESOLVE_CONFLICT = "Cannot resolve conflict with:";
    DATE_ROLLBACK = "Date roll-back encountered at:";
    SKIPPED_FILE = "Skipped file: %@";
    
    EXCLUDED_CONFLICT = "Excluded conflict with: %@";
    EXCLUDED_ROLL_BACK = "Excluded date roll-back at: %@";
    SKIPPED_ROLL_BACK = "Skipped date roll-back at:";
	USE_NEWER = "Use Newer";
	USE_OLDER = "Use Older";
	USE_LEFT = "Use Left";
	USE_RIGHT = "Use Right";

	SIMPLIFIED_INTERFACE = "Simplified Interface Enabled";
	PRINT_OUT_OF_SYNC_ONLY = "*** Printing out-of-sync entries only ***";
 
	YES = "Yes";
	NO = "No";
	NONE = "None";
	COPY = "Copy";
	REPORT_TO_USER = "Report to User";
	ASK_USER = "Ask User";
		
    NON_APPLICABLE = "n/a";
	
    ALIAS_DESC = "Alias";
    ALIAS_TO = "Alias to ";
    SLINK_DESC = "Symbolic Link";
    SLINK_TO = "Symbolic Link to ";
    NO_DIRECTORY = "Couldn't create folder, %@";
    NO_PACKAGE = "Couldn't create package, %@";
    CREATING_DIR = "Occurred while creating folder";
    CREATING_PKG = "Occurred while creating package folder";
    COPYING_FILE = "Occurred while copying file";
    COPYING_TO_FILE = "Occurred while copying to file";
    ATTRIBUTES_TO_FILE = "Occurred while applying attributes to file";
    EA_TO_FILE = "Occurred while applying extended attributes to file";
    ACL_TO_FILE = "Occurred while applying access control lists to file";
    RESOLVING_SYM_LINK = "Occurred while resolving symbolic link";
    CREATING_SYM_LINK = "Occurred while creating symbolic link";
    
    PERFORM_FILE_OP = "Occurred while performing file operation";
    TRASH_FAIL = "Couldn't instruct Finder to move file to trash.";
	MOVING_TRASH = "Occurred while moving to trash";
    DELETE_FAIL_ERR = "Couldn't delete file (%d).";
    DELETING_IMMEDIATELY_ERR_OP = "Occurred while deleting file immediately.";
	DELETING_TO_ARCHIVE_ERR_OP = "Occurred while moving file to archive.";
	RETRY_COPY = "Retrying synchronization of: %@";
	RETRY_DELETE = "Retrying deletion of: %@";
    ANALYZING = "Analyzing: %@";
    PRUNING = "Pruning: %@";
    PREPARE_MSG = "Preparing...";
    CONNECT_MSG = "Connecting...";
    FINISHING_MSG = "Finishing up...";
	OPTIMIZING_BOOT_TARGET_MSG = "Optimizing bootable target...";
    OP_COMPLETE = "Operation completed";
    NO_CONNECT_DEST = "Couldn't connect to destination target";
    NO_CONNECT_SOURCE = "Couldn't connect to source target";
    FATAL_TERMINATING = "Fatal - terminating sync. operation.";
    ABORTED = "*** Aborted ***";
	F_BUSY = "The file is in use by another application";
	F_COPY = "copying file";
    PARENS_ERRORS = " (with errors)";
    RESUME = "Resume";
    PAUSE = "Pause";
    USER_ABORT = "Aborted by user...";
    USER_PAUSE = "Paused by user...";
	ITEM_DISAPPEARED = "Disappeared while scanning: %@";
	
	
    LOADING = "Loading";
    IDLE = "Idle";
    PAUSED = "Paused";
    ABORTING = "Aborting";
    SCANNING = "Scanning";
    RUNNING = "Running";
    MAINTAINING = "Maintaining";
    FINISHING = "Finishing";
    PERCENT_COMPLETE = "%@\n(%d%% complete)";
    LAST_RUN = "%@\nLast run: %@";
	WITH_ERRORS = "\nw/errors";
	DAYS = "days";
	
	
	NONE_SELECTED = "<None Selected>";
	INFINITY = "∞";
	PERCENT_COMPLETE2 = "(%d%% complete - %@)";
	PERCENT_COMPLETE3 = "(Archiving...)";

	// Exceptions
	EXCEPTION_TITLE = "A Program Error Occurred!";
	EXCEPTION_MSG = "You should attempt to save your work and quit the program. If the problem persists, please contact technical support at support@econtechnologies.com.\n\n%@ %@\n";

	// New Strings for CS4
	
	NEW_FOLDER_NAME = "untitled folder";
	NAME_TAKEN_STR = "This name is already taken.";
	NON_AGENT_NAME = "Local Volumes";
	LOCAL_AGENT_NAME = "Local Volumes (Admin access)";
	INTERNET_AGENT_NAME = "Internet Address";
	WARNING_REMOTE_AGENT_VERIFY = "*** Cannot contact remote agent ***";
	WARNING_AGENT_VERIFY = "*** Cannot contact local agent ***";
	LOCAL_DRAG_MESSAGE = "Drag folder or volume here...";
	REMOTE_CHOOSE_MESSAGE = "Click 'Choose' to change...";
	CONNECTING_AGENT_MESSAGE = "\nConnecting to agent...";
    
	EXTRACTING_ARCHIVED_FILE = "Occurred while extracting compressed file from archive";
    ARCHIVE_COMPRESS_CHANGE = "Archive Compression Change";
    COPY_INSTEAD_OF_MOVE_CHANGE = "Copy to Archive Change";
	COMPRESSED_PREFIX = "Compressed %@";
	"Error Code: -3285" = "Lost connection with agent.";
	FINDER_COMMENT_TRIGGER_CHANGE = "Finder Comment Trigger Change";
	EAS_TRIGGER_CHANGE = "Extended Attributes Trigger Change";
	ACL_TRIGGER_CHANGE = "Access Control List Trigger Change";
    
    SKIP_SAFE_COPY_CHANGE = "Disable Safe Copy Change";
	SCRIPTS_CONTROL_PANEL = "Scripts";
    SCRIPT_RULE_NAME = "External Script";
    SCRIPT_RULE_DESC = "Execute script file at path";
	FILENAME_CASE_TRIGGER_CHANGE = "Filename Case Trigger Change";
    CONNECT_TO_FORMAT = "Loading: %@";
    LOG_CONTAINER_START = "Container synchronization start for: %@.";
    CONTAINER_OP_COMPLETE = "Container operation completed";
    TAB_LABEL_DOCUMENTS = "Documents";
	VIEW_MENU_TITLE = "View";
	CONTINUE_AFTER_ERRORS_CHANGE = "Continue After Errors Change";
    CONTAINER_SYNCH_TIME_DESC = "Container last completely executed: ";
	TARGET_PERMS_NEED_CHANGE = "The target volume '%@' is currently ignoring ownership of files. This needs to be changed in order to create a bootable backup. Would you like to have ChronoSync attempt to change this volume property for you?";
	TARGET_PERMS_CHANGE_SUCCESS = "The 'Ignore ownership on this volume' property of the target volume '%@' has been set to OFF. To revert this setting, select the volume's icon in the Finder and perform a 'Get Info' operation. The property's state can be changed at the bottom of the 'Get Info' window.";
	TARGET_PERMS_CHANGE_FAIL = "ChronoSync could not change the 'Ignore ownership on this volume' property of the target volume '%@'. To manually change this setting, select the volume's icon in the Finder and perform a 'Get Info' operation. The property's state can be changed at the bottom of the 'Get Info' window.";
	AGENT_CONECT_FAIL_ERROR = "Could not connect to agent. Make sure the remote agent is configured properly and/or the remote computer is accessible on the network.";
	WARNING_UNSPECIFIED_PATH = "Click 'Choose' to specify a target volume or folder...";
	WARNING_UNSPECIFIED_PATH2 = "";
	BULLET_PREFIX = "• ";
	VOLUME_SIZE_FORMAT = "%@ (%@ avail, %@%% full)";
	VOLUME_CANT_DETERMINE_SIZE = "Can't determine size";
    GBYTE_VALUE_TYPE = " GB";
    TARGET_OPTIONS_CHANGE = "Target Volume Options Change";
	NOTIFY_SUBJECT_CHANGE = "Email Subject Change";
	SINGLE_EA_PROP_SUMMARY = "1 property";
	MULTI_EA_PROP_SUMMARY = "%d properties";
	SYNC_SEL_LABEL = "Synchronize Selection";
	TRIAL_SYNC_SEL_LABEL = "Trial Synchronize Selection...";

    SYNCH_SEL_TB_LABEL = "Sync. Selection";
    TOOL_TIP_SYNCH_SEL = "Performs a synchronization on selected items.";
    TRIAL_SYNCH_SEL_TB_LABEL = "Trial Sync. Selection";
    TOOL_TIP_TRIAL_SYNCH_SEL = "Performs a trial synchronization on selected items.";    

    EXCLUDED_BY_USER = "User excluded: %@";
	SKIP_SUMMARY_CHANGE = "Completion Summary Change";
	FILE_HANDLING_MODE_CHANGE = "Special Handling Change";
	SYNC_TRIGGER_MODE_CHANGE = "Sync. Trigger Change";
	


	TRIGGER_BOOTABLE_DESC = "Triggers are overridden by the 'Bootable' synchronizer operation.";
	
	FINDER_COMMENT_SYNC_TOOLTIP = "Preserves Finder/Spotlight comments associated with files and folders.";
	FINDER_COMMENT_TRIGGER_TOOLTIP = "Changes to Finder/Spotlight comments will trigger an attribute sync.";
	FINDER_COMMENT_DISABLED_TOOLTIP = "Disabled because at least one of the targets doesn't support comment preservation.";
	FINDER_COMMENT_DISABLED2_TOOLTIP = "Disabled because comment preservation has been turned off.";

	DELFOLDER_WARN_MSG = "The 'Move to '%@' folder' deletion method has been phased out. It's still an option for backward compatability. You should consider the 'Move to Archive' option instead.";
	
	DUPLICATE_TEMPLATE = "Duplicate Template Name";
	DUPLICATE_TEMPLATE_MSG = "A template with the name '%@' already exists. Would you like to replace it?";
	TEMPLATE_NAME_SUFFIX = " Template";
	TEMPLATE_NAME_PREFIX = "Template ";
	TEMPLATE_NAME_NO_PERIOD = "Names cannot begin with a period.";
	TEMPLATE_NAME_NO_SEPARATORS = "Names cannot contain a ':' or a '/'.";
	TEMPLATE_INSTALL_FAILED = "Template Install Failed";
	TEMPLATE_INSTALL_FAILED_MSG = "The template named '%@' could not be installed.";
	TEMPLATE_REPLACE_FAILED = "Template Replacement Failed";
	TEMPLATE_REPLACE_FAILED_MSG = "The template named '%@' could not be replaced.";
	TEMPLATE_INSTALL_OK = "Template Installation Complete";
	TEMPLATE_INSTALL_OK_MSG = "The template named '%@' has been successfully installed.";
	NO_TEMPLATES_AVAILABLE_MSG = "No templates available";
	
	SAVE_AS_DEFAULT_LABEL = "Save Default Document Settings";
	SAVE_AS_DEFAULT_SYNC_MSG = "This function will take all the settings of the current synchronizer document and make them the default settings for all new synchronizer documents. Are you sure you want to do this?";
	SAVE_AS_DEFAULT_CSYN_MSG = "This function will take all the settings of the current container document and make them the default settings for all new container documents. Are you sure you want to do this?";

	AGENT_NOT_AUTHORIZED = "Cannot Access Filesystem";
	AGENT_NOT_AUTHORIZED_MSG = "You are not authorized to have full access to the local filesystems. Only users with administrative privileges can gain access.";
	
	CHOOSE_LABEL = "Choose...";
	CHOOSE_BUTTON_TOOLTIP = "Selects a folder or disk volume as your target.";
	
	CONNECT_LABEL = "Connect...";
	CONNECT_BUTTON_TOOLTIP = "Reconnects to: %@";
	CONNECTING_LEFT_TARGET = "Connecting to left target...";
	CONNECTING_RIGHT_TARGET = "Connecting to right target...";
	
	BOOTABLE_TITLE = "Bootable";
	
    TOOL_TIP_SAVE_LOG = "Save the log to a text file";
	
	TOOL_TIP_CLEAR_LOG = "Clear all entries from the log";
	TOOL_TIP_OPTIONS_LOG = "Edit log options";
	
	RESTORE_COMMAND_TITLE = "Restore";
	RESTORE_OPTIONS_MAIN_SINGLE = "Select the destination where \"%@\" will be restored to...";
	RESTORE_OPTIONS_MAIN_MULTI = "Select the destination where the selected items will be restored to...";
	
	
	
	RESTORE_OPTION_PLACEMENT_SINGLE = "\"%@\" will be placed in the appropriate location within %@.";
	RESTORE_OPTION_PLACEMENT_MULTI = "Restored items will be placed in the appropriate location within %@.";
	RESTORE_OPTION_SPECIFIC_SINGLE = "\"%@\" will be placed in a specific folder that you will choose.";
	RESTORE_OPTION_SPECIFIC_MULTI = "Restored items will be placed in a specific folder that you will choose.";




	
	OPEN_ZIP_FAILED_DESC = "Could not open the compressed file \"%@\" located at: %@";

	DISSECTPKGS_WARN_LABEL = "Dissect Packages Notice";
	DISSECTPKGS_WARN_MSG = "Changing the 'Dissect Packages' setting after having performed a synchronization may lead to unpredictable results. It is recommended that you create a new synchronizer document if a change in this behavior is desired.";

	

	DELETING_TO_ARCHIVE2_ERR_OP = "Occurred while copying file to archive.";
	DELETING_TO_ARCHIVE3_ERR_OP = "Occurred while compressing file to archive.";
	
	RESET_PREFERENCES = "Reset Preferences";
	RESET_PREFERENCES_MSG = "This operation will reset all application and document preference settings to their original \"factory\" settings. Existing documents will NOT be affected by this change. Are you sure you want to do this?\n";
	RESET_PREFERENCES_COMPLETE = "Reset Preferences Complete";
	RESET_PREFERENCES_COMPLETE_MSG = "All preferences have been restored to their original settings.";

	DISABLE_SAFE_COPY_WARNING = "Disabling 'safe-copy' may result in lost files on your destination target if an error occurs while copying files. It should only be turned off if storage space is limited. Are you sure you want to do this?";

	FILE_COUNT_WARN_LABEL = "File Count Warning";
	MAX_FILE_COUNT_WARN_LABEL_MSG = "The maximum file count cannot be less than the minimum file count you've just specified. The maximum file count value has been adjusted accordingly.";
	MIN_FILE_COUNT_WARN_LABEL_MSG = "The minimum file count cannot exceed the maximum file count you've just specified. The minimum file count value has been adjusted accordingly.";

	COPY_MOVE_WARN_LABEL = "File Copy Warning";
	COPY_MOVE_WARN_MSG = "Copying a file to the archive instead of moving it can be a significantly more time consuming operation. This option should only be chosen if your destination filesystem does not properly support file move operations.";

	DEMO_AGENT_NOTICE = "The selected remote connection is running under demo restrictions. ChronoSync will only be able to scan a maximum of 5000 files on this connection.\n\nTo purchase a ChronoAgent just click the purchase button.\n\n";
	DEMO_LEFT_TARGET_FILE_LIMIT_MSG = "The left target connection is running in demo mode and thus ChronoSync will only scan a maximum of 5000 files. The synchronization you just performed reached this limit and thus may not be complete.\n\nTo purchase a ChronoAgent just click the purchase button.\n\n";
	DEMO_RIGHT_TARGET_FILE_LIMIT_MSG = "The right target connection is running in demo mode and thus ChronoSync will only scan a maximum of 5000 files. The synchronization you just performed reached this limit and thus may not be complete.\n\nTo purchase a ChronoAgent just click the purchase button.\n\n";
	DEMO_BOTH_TARGETS_FILE_LIMIT_MSG = "Both target connections are running in demo mode and thus ChronoSync will only scan a maximum of 5000 files. The synchronization you just performed reached this limit and thus may not be complete.\n\nTo purchase a ChronoAgent just click the purchase button.\n\n";

    ALIAS_RESOLVE_FILE = "Occurred while resolving the alias file";
	ALIAS_RESOLVE_DEST_ERROR_MSG = "The alias file could not be resolved on the destination target.";
	ALIAS_FOLDER_FAIL_ERROR_MSG = "A counterpart folder for the alias file could not be created on the destination target.";
	ALIAS_ATTRIBUTES_FAIL_ERROR_MSG = "Could not retrieve attributes from resolved alias file.";
	CREATE_TEMP_FILE_ERR_MSG = "Could not create a temporary file name.";
    PREPARING_COPY_TO_FILE = "Occurred while preparing to copy to file";
	
	TARGET_PATH_NOT_SPECIFIED = "Target path has not been specified.";
	
	ADD_EDIT_REMOVE_MENU_TITLE = "Add/edit/remove connection...";

	CONNECTION_PROFILE_NOT_AVAILABLE_TITLE = "Connection Profile Not Available";
	CONNECTION_PROFILE_NOT_AVAILABLE_MSG = "The connection profile is no longer available.";
	CONNECTION_PROFILE_CHANGED_TITLE = "Connection Profile Changed";
	CONNECTION_PROFILE_CHANGED_MSG = "The connection profile has changed.  The document should be closed and then reopened in order for the changes to take effect.";
	CONNECTION_PROFILE_DOES_NOT_EXIST_TITLE = "The Connection Profile Does Not Exist";
	CONNECTION_PROFILE_DOES_NOT_EXIST_MSG = "One of the targets in this document uses a connection profile named, '%@', which does not exist on this system.  Do you want to add the connection profile to your system?\n\nIf you choose \"NO\" then the document will be opened without a connection profile and you will need to manually select a new target.\n\n";

	SYNC_ATTR_TRIGGER_WARNING_LABEL = "Trigger Change Warning";
	SYNC_ATTR_TRIGGER_WARNING_MSG = "Changing triggers for a previously synchronized document may not lead to the expected results. You should consider creating a new synchronizer document instead.\n";

	BAD_PASSWORD_TITLE = "Incorrect password";
	BAD_PASSWORD_MESSAGE = "The password you specified was incorrect. Please try again.";

    SCANNING_DIR = "Occurred while scanning folder";
    OCCUR_SETTING_CUSTOM_ICON = "Occurred while setting custom icon";
	OCCUR_SETTING_FOLDER_METADATA = "Occurred while setting folder metadata";
	
	MOUNT_MENU_TITLE = "Mount";
	CONNECT_MENU_TITLE = "Connect";

    PRESERVE_ACLS_CHANGE = "Preserve Access Control Lists Change";
	ACL_TRIGGER_TOOLTIP = "Changes to a file's access control list will trigger an attribute sync.";
	ACL_DISABLED_TOOLTIP = "Disabled because access control list preservation has been turned off.";

	AUTO_EXCLUDE_CHANGE = "Auto-Exclude New Items Change";

	RETRY_ERRORS_CHANGE = "Retry on Errors Change";

	GENERAL = "General";
	INCLUSION = "Inclusion";
	EXCLUSION = "Exclusion";

    CASE_SENSITIVE_CHANGE = "Case Sensitive Change";
	CASE_SENSITIVE = "case sensitive";
	
	OPEN_PREFERENCES = "Preferences...";

	SECURE_CONNECTION = "Secure connection";

	// Sync Status Tooltips
	SS_VIOLATES_RULE_TOOLTIP = "Violates rule";
	SS_IGNORED_TOOLTIP = "Ignored";
	SS_FORCE_L2R_TOOLTIP = "Force left-to-right";
	SS_FORCE1_L2R_TOOLTIP = "One-time force left-to-right";
	SS_FORCE_R2L_TOOLTIP = "Force right-to-left";
	SS_FORCE1_R2L_TOOLTIP = "One-time force right-to-left";
	SS_EXCLUDE_TOOLTIP = "Excluded by user";
	SS_DELETE_LFILE_TOOLTIP = "Delete left file";
	SS_DELETE_RFILE_TOOLTIP = "Delete right file";
	SS_DELETE_LFOLDER_TOOLTIP = "Delete left folder";
	SS_DELETE_RFOLDER_TOOLTIP = "Delete right folder";
	SS_ATTR_CONFLICT_TOOLTIP = "Attribute conflict";
	SS_FILE_CONFLICT_TOOLTIP = "File conflict";
	SS_ATTR_L2R_TOOLTIP = "Synchronize attributes left-to-right";
	SS_ATTR_R2L_TOOLTIP = "Synchronize attributes right-to-left";
	SS_FILE_L2R_TOOLTIP = "Synchronize file left-to-right";
	SS_FILE_R2L_TOOLTIP = "Synchronize file right-to-left";
	SS_FOLDER_L2R_TOOLTIP = "Synchronize folder left-to-right";
	SS_FOLDER_R2L_TOOLTIP = "Synchronize folder right-to-left";
	
	// Readiness strings
	SYNC_READINESS_FAIL = "Cannot Run Synchronizer";
	
	SYNC_READINESS_PREFIX_OKAY_TO_SYNC = "Configured and ready to synchronize.";
	SYNC_READINESS_PREFIX_OKAY_TO_SYNC_BUT = "Configured and ready to synchronize, however, you should pay attention to the following conditions:\n\n";
	SYNC_READINESS_PREFIX_NOT_OKAY_TO_SYNC = "Synchronization cannot be performed because:\n\n";
	
	SYNC_READINESS_SUMMARY_OKAY_TO_SYNC_BUT = "Ready to synchronize with some warnings (click for details).";
	SYNC_READINESS_SUMMARY_NOT_OKAY_TO_SYNC = "Synchronization cannot be performed (click for details).";
	
	SYNC_READINESS_BOTH_TARGETS_UNSPECIFIED = "• Both the left and right targets have not been specified.";
	SYNC_READINESS_LEFT_TARGET_UNSPECIFIED = "• The left target has not been specified.";
	SYNC_READINESS_RIGHT_TARGET_UNSPECIFIED = "• The right target has not been specified.";
	SYNC_READINESS_BOTH_TARGETS_UNCONNECTED = "• Connection to both the left and right targets have not been established.";
	SYNC_READINESS_LEFT_TARGET_UNCONNECTED = "• Connection to the left target has not been established.";
	SYNC_READINESS_RIGHT_TARGET_UNCONNECTED = "• Connection to the right target has not been established.";
	SYNC_READINESS_BOTH_TARGETS_IDENTICAL = "• The left and right targets are identical to each other.";
	SYNC_READINESS_BOOT_OWNERSHIP_IGNORED_BOTH = "• A bootable backup cannot be created when both target volumes are ignoring file ownership.";
	SYNC_READINESS_BOOT_OWNERSHIP_IGNORED_LEFT = "• A bootable backup cannot be created when the left target volume is ignoring file ownership.";
	SYNC_READINESS_BOOT_OWNERSHIP_IGNORED_RIGHT = "• A bootable backup cannot be created when the right target volume is ignoring file ownership.";
	SYNC_READINESS_READ_ONLY_LEFT = "• The left target's volume is read-only.";
	SYNC_READINESS_READ_ONLY_RIGHT = "• The right target's volume is read-only.";
	SYNC_READINESS_BOOT_NON_ADMIN_BOTH = "• A bootable backup cannot be created without admin access to both targets.";
	SYNC_READINESS_BOOT_NON_ADMIN_LEFT = "• A bootable backup cannot be created without admin access to the left target.";
	SYNC_READINESS_BOOT_NON_ADMIN_RIGHT = "• A bootable backup cannot be created without admin access to the right target.";
	
	SYNC_READINESS_INVISIBLE_COMMENTS_CONFLICT = "• Preserving comments while NOT ignoring invisibles may be redundant and lead to unexpected results.";
	SYNC_READINESS_OWNERSHIP_ROOT_BOTH = "• Owner/group membership of some files may not be preserved because you do not have full access to both targets.";
	SYNC_READINESS_OWNERSHIP_ROOT_LEFT = "• Owner/group membership of some files may not be preserved because you do not have full access to the left target.";
	SYNC_READINESS_OWNERSHIP_ROOT_RIGHT = "• Owner/group membership of some files may not be preserved because you do not have full access to the right target.";
	SYNC_READINESS_OWNERSHIP_IGNORED_LEFT = "• The left target volume is ignoring file ownership which may lead to unexpected owner/group membership of files.";
	SYNC_READINESS_OWNERSHIP_IGNORED_RIGHT = "• The right target volume is ignoring file ownership which may lead to unexpected owner/group membership of files.";
	SYNC_READINESS_CASE_MISMATCH_LEFT = "• The left target volume has a case sensitive filesystem whereas the right target volume doesn't.";
	SYNC_READINESS_CASE_MISMATCH_RIGHT = "• The right target volume has a case sensitive filesystem whereas the left target volume doesn't.";
	SYNC_READINESS_SYMLINK_MISMATCH_LEFT = "• The left target volume doesn't support symbolic links whereas the right target volume does.";
	SYNC_READINESS_SYMLINK_MISMATCH_RIGHT = "• The right target volume doesn't support symbolic links whereas the left target volume does.";
	SYNC_READINESS_OWNERSHIP_SERVER_BOTH = "• Owner/group membership of some files may not be preserved because both targets reside on a file server.";
	SYNC_READINESS_OWNERSHIP_SERVER_LEFT = "• Owner/group membership of some files may not be preserved because the left target resides on a file server.";
	SYNC_READINESS_OWNERSHIP_SERVER_RIGHT = "• Owner/group membership of some files may not be preserved because the right target resides on a file server.";
	SYNC_READINESS_ATTRIBS_HFS_LEFT = "• Some attributes and metadata may not be preserved because the left target is not a local HFS+ formatted volume.";
	SYNC_READINESS_ATTRIBS_HFS_RIGHT = "• Some attributes and metadata may not be preserved because the right target is not a local HFS+ formatted volume.";
	SYNC_READINESS_NAME_LENGTH_LIMIT_LEFT = "• The left target has a restrictive filename length limit.";
	SYNC_READINESS_NAME_LENGTH_LIMIT_RIGHT = "• The right target has a restrictive filename length limit.";
	SYNC_READINESS_NAME_MSDOS_LEFT = "• The left target has 'MS-DOS' file naming restrictions.";
	SYNC_READINESS_NAME_MSDOS_RIGHT = "• The right target has 'MS-DOS' file naming restrictions.";
	SYNC_READINESS_FULL_VOLUME_BOTH = "• Both target volumes are getting full.";
	SYNC_READINESS_FULL_VOLUME_LEFT = "• The left target volume is getting full.";
	SYNC_READINESS_FULL_VOLUME_RIGHT = "• The right target volume is getting full.";
	SYNC_READINESS_LEFT_TARGET_NESTED = "• The left target folder is nested within the right target.";
	SYNC_READINESS_RIGHT_TARGET_NESTED = "• The right target folder is nested within the left target.";
	SYNC_READINESS_READ_ACCESS_LEFT = "• Some files might not synchronize because you do not have full access to the left target";
	SYNC_READINESS_READ_ACCESS_RIGHT = "• Some files might not synchronize because you do not have full access to the right target";
	SYNC_READINESS_BAD_SCRIPT_LEFT = "• The 'External Script' rule cannot execute script at path \"%@\" on left target";
	SYNC_READINESS_BAD_SCRIPT_RIGHT = "• The 'External Script' rule cannot execute script at path \"%@\" on right target";
	SYNC_READINESS_NAME_MAY_MSDOS_LEFT = "• The left target may have 'MS-DOS' file naming restrictions.";
	SYNC_READINESS_NAME_MAY_MSDOS_RIGHT = "• The right target may have 'MS-DOS' file naming restrictions.";
	SYNC_READINESS_ACL_MISMATCH_LEFT = "• The left target volume doesn't support extended security (ACLs) whereas the right target volume does.";
	SYNC_READINESS_ACL_MISMATCH_RIGHT = "• The right target volume doesn't support extended security (ACLs) whereas the left target volume does.";
	SYNC_READINESS_LOCAL_ROOT_MISMATCH_LEFT = "• Some file attributes may not be preserved because you have full access to the right target but not the left.";
	SYNC_READINESS_LOCAL_ROOT_MISMATCH_RIGHT = "• Some file attributes may not be preserved because you have full access to the left target but not the right.";
	SYNC_READINESS_BOOT_VOLUME_DESTINATION = "• You cannot perform a bootable backup with the current boot volume as your destination.";
	SYNC_READINESS_INSECURE_SCRIPT_LEFT = "• The 'External Script' rule cannot execute with admin privileges on the left target (security risk).";
	SYNC_READINESS_INSECURE_SCRIPT_RIGHT = "• The 'External Script' rule cannot execute with admin privileges on the right target (security risk).";
	SYNC_READINESS_AGENT_SERVER = "• You cannot specify a target that resides on a file server when connecting to \"Local Volumes (Admin Access)\". Simply try \"Local Volumes\" instead.";
	SYNC_READINESS_BOTH_TARGETS_UNLOCATED = "• Both the left and right target cannot be located.";
	SYNC_READINESS_LEFT_TARGET_UNLOCATED = "• The left target cannot be located.";
	SYNC_READINESS_RIGHT_TARGET_UNLOCATED = "• The right target cannot be located.";
	SYNC_READINESS_EA_PRESERVATION = "• Preserving Extended Attributes when the destination target resides on a file server may cause synchronizations to fail.";
	SYNC_READINESS_RULE_CANCELS_SMARTSCAN = "• SmartScan is disabled because the following rules are incompatible: %@.";
	SYNC_READINESS_DISSECT_SMARTSCAN_WARN = "• Dissect Packages is not recommended when using SmartScan";

	// Strings that need to be translated for v4.1
    TBYTE_VALUE_TYPE = " TB";
	SIMPLE_RULE_DESC = "Scan files if these conditions are met:";
	SOUNDS_CONTROL_PANEL = "Sounds";
	DEFAULT_STR = "Default";
	SUCCESS_SOUND_CHANGE = "Success Sound Change";
	ATTENTION_SOUND_CHANGE = "Attention Sound Change";
	FAILURE_SOUND_CHANGE = "Failure Sound Change";
	SYNC_READINESS_PARTITION_SCHEME_MISMATCH = "• The partition scheme of the destination drive is different from the source drive.";
	SYNC_READINESS_PARTITION_SCHEME_MAY_MISMATCH = "• The partition scheme of the destination drive may be different from the source drive.";
    LOG_SCHED_SYNC_MISSED = "ERROR:  '%@'  missed its last scheduled sync time.  It will be attempted again at its next scheduled time.";
	BAD_EMAIL_TRABNSPORT = "Email Configuration Warning";
	BAD_EMAIL_TRABNSPORT_MSG = "Your email notification settings are configured to use 'Messaging Services', which is no longer reliably supported under Mac OS X. You should change this setting in General Preferences.\n\nNote: This message will not be displayed again.\n";
	CLICK_CONNECT_TO_AGENT = "Click 'Connect' to establish agent connection.";
	PERCENT_COMPLETE4 = "(Cleaning up...)";
	DEL_SCHED_WARN2 = "Are you sure you wish to delete the selected items?";
	PENDING = "Pending...";
	DISABLED = "Disabled";
	AM = "AM";
	PM = "PM";

	// Strings that need to be translated for v4.2
	BYTE_VERIFY_PROGRESS = "verifying %@ of %@";
	BYTE_COPY_PROGRESS = "copying %@ of %@";
	SKIPPING = "Skipping...";
	DELTA_LEFT = "∆ Left:";
	DELTA_RIGHT = "∆ Right:";
	DISK_SPACE_WARNING_LABEL = "Disk Space Warning";
	LEFT_VOL_LOW_MSG1 = "The left target volume '%@' may not have enough free space to fully complete this synchronization";
	LEFT_VOL_LOW_MSG2 = "The left target volume '%@' does not have enough free space to fully complete this synchronization";
	RIGHT_VOL_LOW_MSG1 = "The right target volume '%@' may not have enough free space to fully complete this synchronization";
	RIGHT_VOL_LOW_MSG2 = "The right target volume '%@' does not have enough free space to fully complete this synchronization";
	TIME_REMAINING_STR = "Time remaining: %@";
	DAYS_REMAINING_STR = "About %1.2f days";
	HOURS_REMAINING_STR = "About %1.1f hours";
	MINUTES_REMAINING_STR = "About %d minutes";
	MINUTE_REMAINING_STR = "About 1 minute";
	SECONDS_REMAINING_STR = "About %d seconds";
	ALMOST_FINISHED_STR = "Almost finished...";

	// New Trial Sync Undo Actions
	TRIAL_SYNC_SCOPE_CHANGE = "Scope Change";
	TRIAL_SYNC_TOGGLE_ENTRY_CHANGE = "Toggle Entry Change";
	TRIAL_SYNC_TOGGLE_ALL_ENTRIES_CHANGE = "Toggle All Entries change";
	TRIAL_SYNC_TOGGLE_MARK_DELETION_CHANGE = "Mark For Deletion Change";
	TRIAL_SYNC_RESET_ENTRY_CHANGE = "Reset Entry Change";
	TRIAL_SYNC_INCLUDE_ENTRY_CHANGE = "Include Entry Change";
	TRIAL_SYNC_EXCLUDE_ENTRY_CHANGE = "Exclude Entry Change";
	TRIAL_SYNC_FORCE_ENTRY_RIGHT_CHANGE = "Force Entry Left-to-Right Change";
	TRIAL_SYNC_FORCE_ENTRY_LEFT_CHANGE = "Force Entry Right-to-Left Change";
	
	

	LOG_RETRY_FAILED_SYNC = "ERROR: '%@' will be attempted again on %@";

	ADD_SCHEDULE_ALERT_TITLE = "Can't Add Schedule";
	ADD_SCHEDULE_ALERT__MSG = "You are already in the process of adding a schedule for another document.  You must finish with it, first, before you can add a schedule for this document.\n";

    SCHEDULER_ERROR_EDIT_REF_DOC = "The referenced document, '%@', could not be loaded!\n\nYou may continue to edit the schedule for the referenced document.  However, you may find certain scheduling options disabled.";

	// New for 4.3
    PRESERVE_EAS_CHANGE = "Preserve Extended Attributes Change";
	EAS_TRIGGER_TOOLTIP = "Changes to extended attributes will trigger an attribute sync.";
	EAS_DISABLED_TOOLTIP = "Disabled because extended attribute preservation has been turned off.";
	PRESERVE_EAS_TOOLTIP = "Preserves extended attributes on filesystems that support them.";
	PRESERVE_EAS_DISABLED_TOOLTIP = "Disabled because at least one of the targets doesn't support optional extended attribute preservation.";

	// Anaylyze Restore Ops
	RESTORE_FILE_FMT = "Restoring: %@";
	RESTORE_FILE_LEFT_FMT = "Restoring: <- %@";
	RESTORE_FILE_RIGHT_FMT = "Restoring: -> %@";
    LOG_RESTORE_START = "Restoration start for: %@.";
    LOG_RESTORE_INFO = "Scanned: %d   Restored: %d   Data Copied: %@   Ignored: %d   Skipped by User: %d   Errors: %d";
	FILE_RESTORE_GENERIC_FMT = "Restore From %@";
	FILE_RESTORE_R2L_MENU_ITEM = "Restore From Right...";
	FILE_RESTORE_L2R_MENU_ITEM = "Restore From Left...";
    RESTORE_ABORTED = "Restoration Aborted";
    RESTORE_COMPLETE = "Restoration Complete";
	RESTORE_NO_ITEMS_COMPLETE = "Restoration Complete (No Items Restored)";
	RETRY_RESTORE = "Retrying restoration of: %@";
	RESTORE_IGNORED = "Ignored: %@";

	// Restore Toolbar Items
	ARCHIVE_RESTORE_ABREV_LABEL = "Restore From Archive";
	FILE_RESTORE_R2L_ABREV_LABEL = "Restore From Right";
    TOOL_TIP_R2L_RESTORE = "Restore by copying files on the right target to the left target.";
	FILE_RESTORE_L2R_ABREV_LABEL = "Restore From Left";
    TOOL_TIP_L2R_RESTORE = "Restore by copying files on the left target to the right target.";

	// Analyze delete ops
	LOG_DELETE_START = "Deletion start for: %@.";
	DELETE_ON_GENERIC_FMT = "Delete From %@";
    DELETE_ABORTED = "Deletion Aborted";
    DELETE_COMPLETE = "Deletion Complete";
	DELETE_NO_ITEMS_COMPLETE = "Deletion Complete (No Items Deleted)";
	DELETE_RIGHT_MENU_ITEM = "Delete From Right...";
	DELETE_LEFT_MENU_ITEM = "Delete From Left...";

	// Delete Toolbar Items
	ARCHIVE_DELETE_ABREV_LABEL = "Delete From Archive...";
    TOOL_TIP_DELETE_ARCHIVE = "Delete selected items from the archive.";
	DELETE_RIGHT_ABREV_LABEL = "Delete From Right...";
    TOOL_TIP_DELETE_RIGHT = "Delete the selected items from the right target.";
	DELETE_LEFT_ABREV_LABEL = "Delete From Left...";
    TOOL_TIP_DELETE_LEFT = "Delete the selected items from the left target.";

	// Scheduler Log
    LOG_BUSY = "BUSY:  '%@' is performing another task and cannot be started.";
	
	// Target naming
	LEFT_TARGET_TITLE = "Left Target";
	LEFT_TARGET_NAME_TITLE = "Edit Left Target Name";
	LEFT_TITLE_FMT = "Left (%@)";
	RIGHT_TARGET_TITLE = "Right Target";
	RIGHT_TARGET_NAME_TITLE = "Edit Right Target Name";
	RIGHT_TITLE_FMT = "Right (%@)";
	
	
	// Scheduled item editor
	ADD_SCHEDULE_DESCRIPTION = "Use the options below to specify when you would like this synchronization to be performed.";
	CREATE_SCHEDULE_DESCRIPTION = "Use the options below to select a synchronizer or container document and indicate when you would like it to run.";
	EDIT_SCHEDULE_DESCRIPTION = "The options below define the schedule for the specified synchronizer or container document.";
	
	// Archive Ops
	DELETING_FILE_FMT = "Deleting: %@";
    LOG_ARCHIVE_DELETION_START = "Archive deletion start for: %@.";
    LOG_DELETION_SUMMARY = "Scanned: %d   Deleted: %d   Data Deleted: %@   Skipped by User: %d   Errors: %d";
	SYNCHRONIZER_NOT_IDLE = "synchronizer is not idle";
	OP_COULDNT_START = "Could not start the operation (%@).";
	SKIP_ADDITIONAL_ERRORS_TITLE = "Skip any additional errors";
	ADDITIONAL_DUPLICATES_TITLE = "Apply to additional duplicates";
    LOG_ARCHIVE_RESTORE_START = "Archive restoration start for: %@.";
    LOG_ARCHIVE_RESTORE_SUMMARY = "Scanned: %d   Restored: %d   Data Copied: %@   Skipped by User: %d   Errors: %d";
	ARCHIVE_ZIP_EXTRACTING_PCT = "(Extracting compressed file...)";
	RESTORE_OPTIONS_TITLE_GENERIC_FMT = "Restore to %@";
	DELETE_PROCESSED_LABEL = "... deleted:";
	RESTORE_PROCESSED_LABEL = "... restored:";

	
	
	// Error Messages
	PARENT_NOT_A_FOLDER = "Parent pathname does not reference a folder";
	
	// Analysis report
	PRINT_CUSTOM_STATUS_ONLY = "*** Printing excluded and forced entries only ***";
	PRINT_ALL_ENTRIES = "*** Printing all entries ***";
	PRESERVE_EAS_SUMMARY = "Preserve extended attributes:";
	NO_MATCHING_ENTRIES = "No matching entries.";
	
	// Rule actions
	ADD_RULE_ACTION = "Add Rule...";
	ADD_GROUP_ACTION = "Add Group...";
	
	// Sync Triggers
	FILENAME_CASE_TRIGGER_TOOLTIP = "Upper/lower case changes to the filename will synchronize.";
	FILENAME_CASE_TRIGGER_DISABLED_TOOLTIP = "Disabled because both targets reside on case sensitive filesystems.";
	
	// New for 4.3.5
	PRESERVE_ACLS_TOOLTIP = "Preserves access control lists on filesystems that support them.";
	PRESERVE_ACLS_DISABLED_TOOLTIP = "Disabled because at least one of the targets doesn't support access control lists.";
	
	// New for 4.3.6
    CONN_INFO = "Scanned: %d\nProcessed: %d (%@)\nErrors: %d";	
	
	// Template Filename Translations
	
	TNX_Aliases_and_Symbolic_Links = "Aliases and Symbolic Links";
	TNX_Cache_Files = "Cache Files";
	TNX_Common_Audio_File_Formats = "Common Audio File Formats";
	TNX_Common_Compressed_File_Formats = "Common Compressed File Formats";
	TNX_Common_Disk_Image_File_Formats = "Common Disk Image File Formats";
	TNX_Common_Font_Formats = "Common Font Formats";
	TNX_Common_Image_File_Formats = "Common Image File Formats";
	TNX_Common_Page_Layout_Formats = "Common Page Layout Formats";
	TNX_Common_Text_Document_Formats = "Common Text Document Formats";
	TNX_Common_Video_File_Formats = "Common Video File Formats";
	TNX_Common_Web_Formats = "Common Web Formats";
	TNX_Don_t_Delete_Files_at_Root_Level_of_Left_Target = "Don't Delete Files at Root Level of Left Target";
	TNX_Don_t_Delete_Files_at_Root_Level_of_Right_Target = "Don't Delete Files at Root Level of Right Target";
	TNX_Exclude_Cache_Files = "Exclude Cache Files";
	TNX_Executable_Packages = "Executable Packages";
	TNX_Invisible_Files_at_Root_Level_of_Either_Target_Template = "Invisible Files at Root Level of Either Target Template";
	TNX_Invisible_Files_at_Root_Level_of_Left_Target_Template = "Invisible Files at Root Level of Left Target Template";
	TNX_Invisible_Files_at_Root_Level_of_Right_Target_Template = "Invisible Files at Root Level of Right Target Template";
	
	// New for 4.4
    FASTSCAN_CHANGE = "SmartScan Change";
	FASTSCAN_NOTICE_LABEL = "SmartScan Notice";
	FASTSCAN_NOTICE_MSG = "Before enabling SmartScan on a pre-ChronoSync 4.4 synchronizer document, you must first synchronize your files and then perform a Baseline Scan operation (available from the 'Actions->Synchronize' menu.)";
	FAST_SCAN_ACTIVE = "SmartScan Active";
	
	RESOLVE_ALIASES_TOOLTIP = "Refer to the original item when scanning and copying.";
	RESOLVE_ALIASES_DISABLED_TOOLTIP = "Disabled because at least one of the targets doesn't support alias resolution.";

	DISCRETE_VERIFY_PROGRESS = "verifying data...";
	
	// New for v4.5
	REM_DOCREF_WARN = "Are you sure you want to remove the reference to the selected document?";
	REM_OR_DELETE_WARN_TITLE = "Remove or Delete Item";
	REM_OR_DELETE_DOC_WARN = "Do you want to remove just the reference to this document or would you like to permanently delete the document from storage?\n\n";
	REMOVE_DOCREF = "Remove Reference";
	DELETE_DOC = "Permanently Delete";
	DELETE_SYNC_DOC_WARN_TITLE = "Delete Synchronizer Document";
	DELETE_SYNC_DOC_WARN_MSG = "Are you sure you want to permanently delete this synchronizer document?";
	DELETE_CONTAINER_DOC_WARN_TITLE = "Delete Container Document";
	DELETE_CONTAINER_DOC_WARN_MSG = "Are you sure you want to permanently delete this container document?";
	CANNOT_DELETE_DOC = "Cannot Delete Document";
	CANNOT_DELETE_RUNNING_SYNC_MSG = "The selected document is performing a synchronization and cannot be deleted at this time.";
	DELETE_FAILED_ERROR_FORMAT = "The deletion operation failed (%@).";
	REMOVE_DOC_AND_ARCHIVE_TITLE = "Delete Document Archive?";
	REMOVE_DOC_AND_ARCHIVE_ONE_MSG = "This synchronizer document is maintaining an archive on one of its targets. Files stored in an archive are typically not useful after the synchronizer is deleted. Would you like to also delete the files in the archive or just the synchronizer document?\n\n";
	REMOVE_DOC_AND_ARCHIVE_BOTH_MSG = "This synchronizer document is maintaining archives on both of its targets. Files stored in an archive are typically not useful after the synchronizer is deleted. Would you like to also delete the files in both archives or just the synchronizer document?\n\n";
	REMOVE_DOC_AND_ARCHIVE = "Delete Archive w/Document";
	REMOVE_DOC_ONLY = "Delete Document";
	REMOVE_ARCHIVE_DELETE_FILE_FAIL = "Could not delete file '%@' in archive for target %@.";
	REMOVE_ARCHIVE_DELETE_FOLDER_FAIL = "Could not delete folder '%@' in archive for target %@.";
	REMOVE_ARCHIVE_DELETE_SOME_ITEMS = "Note: Some items were deleted from the archive before the operation was aborted.";
	TITLE_SYNC_DOC_RENAME = "Rename Synchronizer Document";
	TITLE_CONTAINER_DOC_RENAME = "Rename Container Document";
	TITLE_SYNC_DOC_DUPLICATE = "Duplicate Synchronizer Document";
	TITLE_CONTAINER_DOC_DUPLICATE = "Duplicate Container Document";
	COPY_SUFFIX = " copy";
	COPY_SUFFIX_FMT = " copy %d";
	DUPLICATION_FAILED_TITLE = "Duplication Failed";
	DUPLICATION_FAILED_MSG = "Could not duplicate the selected document.";
	DUPLICATION_LOG_FMT = "Synchronizer document duplicated from: %@";
	TOOL_TIP_LION_ONLY = "This option is only available on Mac OS X 10.8 (or later).";
	POST_USER_NOTIFY_CHANGE = "Post Notification Change";
	NOTIFY_ONLY_ERRORS_CHANGE = "Post Only Errors Change";
	NOTIFY_SUBTITLE_FMT = "'%@' has completed.";
	POST_USER_NOTIFICATIONS_LABEL = "User Notifications:";
	POST_USER_NOTIFACTION_ON_ERRORS = "Posted (on errors only)";
	POST_USER_NOTIFACTION_ALWAYS = "Posted";
	BOOTABLE_MIRROR_LTOR = "Bootable mirror left-to-right";
	BOOTABLE_MIRROR_RTOL = "Bootable mirror right-to-left";
    ERROR_ON_TARGET_FMT = "%@ encountered error: \"%@\"";
	MISSED_SYNC_NOTIFICATION_TITLE = "Scheduler: Missed Sync.";
	MISSED_SYNC_NOTIFICATION_FMT = "'%@'  missed its last scheduled sync time.";
	MISSED_SYNC_NOTIFICATION_DESC= "It will be attempted again at its next scheduled time.";
	SCHEDULED_SYNC_NOTIFICATION_TITLE = "Scheduler: Sync. Complete";
	SCHEDULED_SYNC_ERRORS_NOTIFICATION_TITLE = "Scheduler: Failed Sync.";
	SCHEDULED_SYNC_NO_ERRORS_MSG = "No errors.";
	SCHEDULED_SYNC_ONE_ERROR_MSG = "1 error occured.";
	SCHEDULED_SYNC_MULTI_ERRORS_FMT = "%d errors occured.";
	FAILED_START_NOTIFICATION_FMT = "'%@'  could not be started.";
	RESET_ARCHIVE_TITLE = "Reset Document Archive?";
	RESET_ARCHIVE_MSG = "This synchronizer document is maintaining an archive. Would you like to reset the archive to an empty state in the duplicate document? A reset is recommended so that two synchronizer documents do not share the same archive.\n\n";
	RESET_ARCHIVE_LABEL = "Reset";
	RESET_ARCHIVE_LOG_MSG = "Archive was reset to empty state.";
	RETAIN_ARCHIVE_LABEL = "Retain";
	DONT_SAVE_LABEL = "Don't Save";
	DUPLICATE_UNSAVED_WARN_TITLE = "Save Document Changes?";
	DUPLICATE_UNSAVED_WARN_MSG = "This document contains unsaved changes. Would you like to save the changes before making a duplicate of the document?";
	SYNC_READINESS_DEMO_AGENT_LEFT = "• The left target's remote agent is running in demo mode.";
	SYNC_READINESS_DEMO_AGENT_RIGHT = "• The right target's remote agent is running in demo mode.";
	SYNC_READINESS_DEMO_AGENT_BOTH = "• Both remote agents are running in demo mode.";
	INITIAL_NOTIFICATION_SUBJECT = "New ChronoSync Notifications";
	INITIAL_NOTIFICATION_MSG = "Find out more...";
	LOG_RETRY_LIMIT_REACHED = "ERROR: Retry limit of %d has been reached for '%@'. Giving up.";
	LOG_INVOKED_BY_USER = "'%@' invoked by user.";
	CONSIDER_ADMIN_ACCESS_APPEND = " Consider enabling 'Admin Access' (a 'Connect to:' option in the 'Setup' panel) for this target.";
	DISABLED_NO_ADMIN_PRIVS = "Disabled because you do not have administrator privileges.";

	EXPRESS_CANT_DUPLICATE_TITLE = "Cannot Duplicate Document";
	EXPRESS_CANT_DUPLICATE_MSG = "ChronoSync Express does not have write access to the \"%@\" folder where the \"%@\" document is located.\n";
	EXPRESS_SELECT_FOLDER_FOR_ACCESS = "Select the folder containing \"%@\"";
	GRANT_ACCESS = "Grant Access";
	CANT_RENAME_TITLE = "Cannot Rename Document";
	CANT_RENAME_MSG = "ChronoSync does not have write access to the selected document";
	EXPRESS_CANT_DELETE_TITLE = "Cannot Delete Document";
	EXPRESS_CANT_ACCESS_ARCHIVE_TITLE = "Cannot Access Archive";
	EXPRESS_CANT_ACCESS_ARCHIVE_MSG = "ChronoSync Express does not have write access to the archive used by this document.\n";

	// New for v4.6
	DOCUMENT_TB_LABEL = "Document";
	TOOL_TIP_DOCUMENT = "The document you are editing.";
	LOG_SMART_SCAN_RESET_FMT = "Resetting SmartScan state for: %@";
	SMART_SCAN_QUERY_MSG = "Preparing SmartScan ...";
	PUSH_NOTIFICATION_CHANGE = "Push Notification Change";
	PUSH_ONLY_ERRORS_CHANGE = "Push Only Errors Change";
	PUSH_SUCCESS = "Success!";
	PUSH_SUCCESS_MESSAGE = "A test push notification was successfully sent.";
	PUSH_FAILURE = "Failure!";
	PUSH_FAILURE_MESSAGE = "Could not send the test notification. Please try again later.";
	PUSH_REGISTER_FAILURE_MESSAGE = "Could not register with the push notification server. Please try again later.";
	PUSH_COMMAND_FAILURE_MESSAGE = "Could not contact the push notification server. Please try again later.";
	PUSH_BAD_RECEIVER_FMT = "Invalid receiver ID: %@";
	PUSH_DOCUMENT_SUMMARY_FMT = "\nDocument: '%@'";

	SOURCE_TARGET_TITLE = "Source Target";
	SOURCE_TARGET_NAME_TITLE = "Edit Source Target Name";
	SOURCE_TITLE_FMT = "Source (%@)";
	DESTINATION_TARGET_TITLE = "Destination Target";
	DESTINATION_TARGET_NAME_TITLE = "Edit Destination Target Name";
	DESTINATION_TITLE_FMT = "Destination (%@)";
	
	ASSERT_VOLUME_OWNERSHIP_TOOLTIP = "Indicates whether or not to force the specified ownership behavior on the target's volume.";
	ASSERT_VOLUME_OWNERSHIP_MODE_TOOLTIP = "The ownership behavior to assert on the target's volume. The 'Ignore' setting is the same as choosing 'Ignore ownership on this volume' in Finder's 'Get Info' window.";
	ASSERT_VOLUME_OWNERSHIP_UNAVAILABLE1_TOOLTIP = "Disabled because you do not have Administrator access. Choose 'Local Volumes (Admin Access)' for your 'Connect to' setting.";
	ASSERT_VOLUME_OWNERSHIP_UNAVAILABLE2_TOOLTIP = "Disabled because ownership behavior cannot be modified on this target's volume.";
	ASSERT_VOLUME_OWNERSHIP_UNAVAILABLE3_TOOLTIP = "Disabled because ownership behavior is automatically asserted when performing a bootable operation.";
	IGNORING_OWNERSHIP_LABEL = "Ignoring ownership";

	DISMOUNT_VOLUME_TOOLTIP = "Volume should be dismounted after synchronization completes.";
	DISMOUNT_VOLUME_BY_ME_TOOLTIP = "Dismount should only occur if this document mounted volume in the first place.";
	UNMOUNT_UNAVAILABLE1_TOOLTIP = "Disabled because the device does not have an identifier.";
	UNMOUNT_UNAVAILABLE2_TOOLTIP = "Disabled because you cannot dismount the boot volume.";
	
	LOG_SUSPENSION_REACHED = "Suspension constraint reached.";
	
	SCHEDULED_ONLY_RUN_TARGETS_AVAILABLE_TOOLTIP = "This option indicates that the scheduled item should only run if both target volumes (or agents) are available at the time of scheduled execution.";
	SCHEDULED_ONLY_RUN_TARGETS_AVAILABLE_UNVAILABLE_TOOLTIP = "Option is not available for this type of schedule.";

	DOC_SUMMARY_FMT = "Scanned: %d\nProcessed: %d\nData copied: %@\nSkipped: %d\nErrors: %d";
	
	INVOCATION_MANUAL = "Manual";
	INVOCATION_SCRIPT = "Scripted";
	INVOCATION_SCHEDULED = "Scheduled";

	INITIAL_DOC_NOTE = "Add special notes about this document here...";

    // Added for Finder Tags Rule (CS 4.6.0)
    FINDER_TAG_RULE_NAME = "Finder Tag";
    NO_TAG = "╳ No Tag";
    TAGS_NONE = "\"No Tags\" is on";

	// Added for POSIX Permissions Rule (CS 4.6.0)
	PERMISSIONS_RULE_DESCRIPTION = "Permissions are:";

	// Accessibility
	ACCESS_SIDEBAR_DESC = "Side bar";
	ACCESS_SIDEBAR_HELP = "Switch between configuration panels of the document";
	
	ADDITIONAL_ERRORS_FMT = "\n... plus %d additional messages.";
	ADDITIONAL_ERROR = "\n... plus 1 additional message.";
	
	VOICE_OVER_HELP_DIMMED = "dimmed";
	
	VOICE_OVER_HELP_COPY_L2R = "Copy left-to-right";
	VOICE_OVER_HELP_COPY_R2L = "Copy right-to-left";
	VOICE_OVER_HELP_CONFLICT = "Conflict";
	VOICE_OVER_HELP_ATTR_L2R = "Attribute left-to-right";
	VOICE_OVER_HELP_ATTR_R2L = "Attribute right-to-left";
	VOICE_OVER_HELP_ATTR_CONFLICT = "Attribute Conflict";
	VOICE_OVER_HELP_IN_SYNC = "In-sync";
	VOICE_OVER_HELP_EXCLUDE = "Exclude";
	VOICE_OVER_HELP_DELETE = "Delete";
	VOICE_OVER_HELP_SKIP = "Skip";
	VOICE_OVER_HELP_RULE_SKIP = "Skip by Rules";
	VOICE_OVER_HELP_FORCE_L2R = "Force left-to-right";
	VOICE_OVER_HELP_FORCE_R2L = "Force right-to-left";
	VOICE_OVER_HELP_FORCE_ONCE_L2R = "Force left-to-right once";
	VOICE_OVER_HELP_FORCE_ONCE_R2L = "Force right-to-left once";
	
	// Added for enhanced progress UI
	ELAPSED_THROUGHPUT_FMT = "%@ (%@/sec.)";
	
	// Added for package merging UI
	PACKAGE_HANDLING_CHANGE = "Package Handling Change";
	MERGE_PACKAGES_SUMMARY = "Merge Packages:";
	
	// Added for new Trial Mode support
	MODE_TRIAL = "Trial Mode";
	TRIAL_MODE_FMT = "Trial Mode: %1.1f days remaining.";
	TRIAL_MODE_1DAY_FMT = "Trial Mode: %1.1f day remaining.";
	TRIAL_SERVER_SUCCESS_TITLE = "Trial Mode activation successful.";
	TRIAL_SERVER_SUCCESS_FMT = "You now have %d days to evaluate ChronoSync!";
	TRIAL_SERVER_FAILED_TITLE = "Trial Mode activation failed.";
	TRIAL_SERVER_FAILED_MSG1 = "A problem occured trying to contact the registration server. Please try again later.";
	TRIAL_SERVER_FAILED_MSG2 = "This copy of ChronoSync has already completed a trial evaluation. Contact sales@econtechnologies.com if you need to extend your trial period.";

	// Added for v4.6.6
	WARNING_CHECK_SECURITY_SETTINGS = "*** Check security settings ***";
	SYNC_READINESS_LEFT_TARGET_INSECURE = "• Left target security settings and/or agent must be updated.";
	SYNC_READINESS_RIGHT_TARGET_INSECURE = "• Right target security settings and/or agent must be updated.";
	SECURITY_ERROR_MSG = "Secure Protocol Error";
	AGENT_CONECT_FAIL_SECURITY_ERROR = "Could not connect to agent. Make sure the connection profile's security settings are correct and that you are using the latest version of the agent.";
	"Error Code: 33" = "Unexpected file size discrepency.";
}

